[
    {
        "id": "2101.10586v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Haekyu Park, Zijie J. Wang, Nilaksh Das, Anindya S. Paul, Pruthvi Perumalla, Zhiyan Zhou, Duen Horng Chau",
        "title": "SkeletonVis: Interactive Visualization for Understanding Adversarial   Attacks on Human Action Recognition Models",
        "comments": "Accepted at AAAI'21 Demo",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Skeleton-based human action recognition technologies are increasingly used in video based applications, such as home robotics, healthcare on aging population, and surveillance. However, such models are vulnerable to adversarial attacks, raising serious concerns for their use in safety-critical applications. To develop an effective defense against attacks, it is essential to understand how such attacks mislead the pose detection models into making incorrect predictions. We present SkeletonVis, the first interactive system that visualizes how the attacks work on the models to enhance human understanding of attacks."
    },
    {
        "id": "2101.11717v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Adrien Gauffriau, François Malgouyres, Mélanie Ducoffe",
        "title": "Overestimation learning with guarantees",
        "comments": null,
        "journal-ref": "AAAI-21, workshop on safeAI, Feb 2021, Valence (Virtual), Spain",
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "We describe a complete method that learns a neural network which is guaranteed to overestimate a reference function on a given domain. The neural network can then be used as a surrogate for the reference function. The method involves two steps. In the first step, we construct an adaptive set of Majoring Points. In the second step, we optimize a well-chosen neural network to overestimate the Majoring Points. In order to extend the guarantee on the Majoring Points to the whole domain, we necessarily have to make an assumption on the reference function. In this study, we assume that the reference function is monotonic. We provide experiments on synthetic and real problems. The experiments show that the density of the Majoring Points concentrate where the reference function varies. The learned over-estimations are both guaranteed to overestimate the reference function and are proven empirically to provide good approximations of it. Experiments on real data show that the method makes it possible to use the surrogate function in embedded systems for which an underestimation is critical; when computing the reference function requires too many resources."
    },
    {
        "id": "2101.10642v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Hyunjin Choi, Judong Kim, Seongho Joe, Youngjune Gwon",
        "title": "Evaluation of BERT and ALBERT Sentence Embedding Performance on   Downstream NLP Tasks",
        "comments": "6 pages, 2 figures, to be published in 25th International Conference\n  on Pattern Recognition, ICPR2020",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Contextualized representations from a pre-trained language model are central to achieve a high performance on downstream NLP task. The pre-trained BERT and A Lite BERT (ALBERT) models can be fine-tuned to give state-ofthe-art results in sentence-pair regressions such as semantic textual similarity (STS) and natural language inference (NLI). Although BERT-based models yield the [CLS] token vector as a reasonable sentence embedding, the search for an optimal sentence embedding scheme remains an active research area in computational linguistics. This paper explores on sentence embedding models for BERT and ALBERT. In particular, we take a modified BERT network with siamese and triplet network structures called Sentence-BERT (SBERT) and replace BERT with ALBERT to create Sentence-ALBERT (SALBERT). We also experiment with an outer CNN sentence-embedding network for SBERT and SALBERT. We evaluate performances of all sentence-embedding models considered using the STS and NLI datasets. The empirical results indicate that our CNN architecture improves ALBERT models substantially more than BERT models for STS benchmark. Despite significantly fewer model parameters, ALBERT sentence embedding is highly competitive to BERT in downstream NLP evaluations."
    },
    {
        "id": "2101.10643v12",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Jie Zhu, Blanca Gallego",
        "title": "Causal inference for observational longitudinal studies using deep   survival models",
        "comments": null,
        "journal-ref": null,
        "doi": "10.1016/j.jbi.2022.104119",
        "report-no": null,
        "categories": "stat.ML",
        "license": null,
        "abstract": "Causal inference for observational longitudinal studies often requires the accurate estimation of treatment effects on time-to-event outcomes in the presence of time-dependent patient history and time-dependent covariates. To tackle this longitudinal treatment effect estimation problem, we have developed a time-variant causal survival (TCS) model that uses the potential outcomes framework with an ensemble of recurrent subnetworks to estimate the difference in survival probabilities and its confidence interval over time as a function of time-dependent covariates and treatments. Using simulated survival datasets, the TCS model showed good causal effect estimation performance across scenarios of varying sample dimensions, event rates, confounding and overlapping. However, increasing the sample size was not effective in alleviating the adverse impact of a high level of confounding. In a large clinical cohort study, TCS identified the expected conditional average treatment effect and detected individual treatment effect heterogeneity over time. TCS provides an efficient way to estimate and update individualized treatment effects over time, in order to improve clinical decisions. The use of a propensity score layer and potential outcome subnetworks helps correcting for selection bias. However, the proposed model is limited in its ability to correct the bias from unmeasured confounding, and more extensive testing of TCS under extreme scenarios such as low overlapping and the presence of unmeasured confounders is desired and left for future work."
    },
    {
        "id": "2101.10649v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Hyunjin Choi, Judong Kim, Seongho Joe, Seungjai Min, Youngjune Gwon",
        "title": "Analyzing Zero-shot Cross-lingual Transfer in Supervised NLP Tasks",
        "comments": "6 pages, 4 figures, to be published in 25th International Conference\n  on Pattern Recognition, ICPR 2020",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "In zero-shot cross-lingual transfer, a supervised NLP task trained on a corpus in one language is directly applicable to another language without any additional training. A source of cross-lingual transfer can be as straightforward as lexical overlap between languages (e.g., use of the same scripts, shared subwords) that naturally forces text embeddings to occupy a similar representation space. Recently introduced cross-lingual language model (XLM) pretraining brings out neural parameter sharing in Transformer-style networks as the most important factor for the transfer. In this paper, we aim to validate the hypothetically strong cross-lingual transfer properties induced by XLM pretraining. Particularly, we take XLM-RoBERTa (XLMR) in our experiments that extend semantic textual similarity (STS), SQuAD and KorQuAD for machine reading comprehension, sentiment analysis, and alignment of sentence embeddings under various cross-lingual settings. Our results indicate that the presence of cross-lingual transfer is most pronounced in STS, sentiment analysis the next, and MRC the last. That is, the complexity of a downstream task softens the degree of crosslingual transfer. All of our results are empirically observed and measured, and we make our code and data publicly available."
    },
    {
        "id": "2101.10657v3",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Daniela A. Zaidenberg, Alessandro Sebastianelli, Dario Spiller, Bertrand Le Saux, Silvia Liberata Ullo",
        "title": "Advantages and Bottlenecks of Quantum Machine Learning for Remote   Sensing",
        "comments": "Submitted and accepted for IEEE IGARSS2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "quant-ph",
        "license": null,
        "abstract": "This concept paper aims to provide a brief outline of quantum computers, explore existing methods of quantum image classification techniques, so focusing on remote sensing applications, and discuss the bottlenecks of performing these algorithms on currently available open source platforms. Initial results demonstrate feasibility. Next steps include expanding the size of the quantum hidden layer and increasing the variety of output image options."
    },
    {
        "id": "2101.10670v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Tobias Joppen, Johannes Fürnkranz",
        "title": "Ordinal Monte Carlo Tree Search",
        "comments": "preprint. arXiv admin note: substantial text overlap with\n  arXiv:1901.04274",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "In many problem settings, most notably in game playing, an agent receives a possibly delayed reward for its actions. Often, those rewards are handcrafted and not naturally given. Even simple terminal-only rewards, like winning equals one and losing equals minus one, can not be seen as an unbiased statement, since these values are chosen arbitrarily, and the behavior of the learner may change with different encodings. It is hard to argue about good rewards and the performance of an agent often depends on the design of the reward signal. In particular, in domains where states by nature only have an ordinal ranking and where meaningful distance information between game state values is not available, a numerical reward signal is necessarily biased. In this paper we take a look at MCTS, a popular algorithm to solve MDPs, highlight a reoccurring problem concerning its use of rewards, and show that an ordinal treatment of the rewards overcomes this problem. Using the General Video Game Playing framework we show dominance of our newly proposed ordinal MCTS algorithm over other MCTS variants, based on a novel bandit algorithm that we also introduce and test versus UCB."
    },
    {
        "id": "2101.10708v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Zhuang Li, Lizhen Qu, Shuo Huang, Gholamreza Haffari",
        "title": "Few-Shot Semantic Parsing for New Predicates",
        "comments": "Accepted to EACL 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "In this work, we investigate the problems of semantic parsing in a few-shot learning setting. In this setting, we are provided with utterance-logical form pairs per new predicate. The state-of-the-art neural semantic parsers achieve less than 25% accuracy on benchmark datasets when k= 1. To tackle this problem, we proposed to i) apply a designated meta-learning method to train the model; ii) regularize attention scores with alignment statistics; iii) apply a smoothing technique in pre-training. As a result, our method consistently outperforms all the baselines in both one and two-shot settings."
    },
    {
        "id": "2101.10710v2",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Satya M. Muddamsetty, Mohammad N. S. Jahromi, Andreea E. Ciontos, Laura M. Fenoy, Thomas B. Moeslund",
        "title": "Visual explanation of black-box model: Similarity Difference and   Uniqueness (SIDU) method",
        "comments": null,
        "journal-ref": "Pattern Recognition 127 (2022): 108604",
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Explainable Artificial Intelligence (XAI) has in recent years become a well-suited framework to generate human understandable explanations of \"black-box\" models. In this paper, a novel XAI visual explanation algorithm known as the Similarity Difference and Uniqueness (SIDU) method that can effectively localize entire object regions responsible for prediction is presented in full detail. The SIDU algorithm robustness and effectiveness is analyzed through various computational and human subject experiments. In particular, the SIDU algorithm is assessed using three different types of evaluations (Application, Human and Functionally-Grounded) to demonstrate its superior performance. The robustness of SIDU is further studied in the presence of adversarial attack on \"black-box\" models to better understand its performance. Our code is available at: https://github.com/satyamahesh84/SIDU_XAI_CODE."
    },
    {
        "id": "2101.10739v2",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Jie Zhu, Blanca Gallego",
        "title": "Dynamic prediction of time to event with survival curves",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "stat.ML",
        "license": null,
        "abstract": "With the ever-growing complexity of primary health care system, proactive patient failure management is an effective way to enhancing the availability of health care resource. One key enabler is the dynamic prediction of time-to-event outcomes. Conventional explanatory statistical approach lacks the capability of making precise individual level prediction, while the data adaptive binary predictors does not provide nominal survival curves for biologically plausible survival analysis. The purpose of this article is to elucidate that the knowledge of explanatory survival analysis can significantly enhance the current black-box data adaptive prediction models. We apply our recently developed counterfactual dynamic survival model (CDSM) to static and longitudinal observational data and testify that the inflection point of its estimated individual survival curves provides reliable prediction of the patient failure time."
    },
    {
        "id": "2101.10759v2",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Xutan Peng, Yi Zheng, Chenghua Lin, Advaith Siddharthan",
        "title": "Summarising Historical Text in Modern Languages",
        "comments": "To appear at EACL 2021",
        "journal-ref": "EACL 2021",
        "doi": "10.18653/v1/2021.eacl-main.273",
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "We introduce the task of historical text summarisation, where documents in historical forms of a language are summarised in the corresponding modern language. This is a fundamentally important routine to historians and digital humanities researchers but has never been automated. We compile a high-quality gold-standard text summarisation dataset, which consists of historical German and Chinese news from hundreds of years ago summarised in modern German or Chinese. Based on cross-lingual transfer learning techniques, we propose a summarisation model that can be trained even with no cross-lingual (historical to modern) parallel data, and further benchmark it against state-of-the-art algorithms. We report automatic and human evaluations that distinguish the historic to modern language summarisation task from standard cross-lingual summarisation (i.e., modern to modern language), highlight the distinctness and value of our dataset, and demonstrate that our transfer learning approach outperforms standard cross-lingual benchmarks on this task."
    },
    {
        "id": "2101.10760v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Xiangyu Xu, Muchen Li, Wenxiu Sun, Ming-Hsuan Yang",
        "title": "Learning Spatial and Spatio-Temporal Pixel Aggregations for Image and   Video Denoising",
        "comments": "Project page: https://sites.google.com/view/xiangyuxu/denoise_stpan.\n  arXiv admin note: substantial text overlap with arXiv:1904.06903",
        "journal-ref": "IEEE Transactions on Image Processing 29 (2020): 7153-7165",
        "doi": "10.1109/TIP.2020.2999209",
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Existing denoising methods typically restore clear results by aggregating pixels from the noisy input. Instead of relying on hand-crafted aggregation schemes, we propose to explicitly learn this process with deep neural networks. We present a spatial pixel aggregation network and learn the pixel sampling and averaging strategies for image denoising. The proposed model naturally adapts to image structures and can effectively improve the denoised results. Furthermore, we develop a spatio-temporal pixel aggregation network for video denoising to efficiently sample pixels across the spatio-temporal space. Our method is able to solve the misalignment issues caused by large motion in dynamic scenes. In addition, we introduce a new regularization term for effectively training the proposed video denoising model. We present extensive analysis of the proposed method and demonstrate that our model performs favorably against the state-of-the-art image and video denoising approaches on both synthetic and real-world data."
    },
    {
        "id": "2101.11702v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Domen Vreš, Marko Robnik Šikonja",
        "title": "Better sampling in explanation methods can prevent dieselgate-like   deception",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Machine learning models are used in many sensitive areas where besides predictive accuracy their comprehensibility is also important. Interpretability of prediction models is necessary to determine their biases and causes of errors, and is a necessary prerequisite for users' confidence. For complex state-of-the-art black-box models post-hoc model-independent explanation techniques are an established solution. Popular and effective techniques, such as IME, LIME, and SHAP, use perturbation of instance features to explain individual predictions. Recently, Slack et al. (2020) put their robustness into question by showing that their outcomes can be manipulated due to poor perturbation sampling employed. This weakness would allow dieselgate type cheating of owners of sensitive models who could deceive inspection and hide potentially unethical or illegal biases existing in their predictive models. This could undermine public trust in machine learning models and give rise to legal restrictions on their use.   We show that better sampling in these explanation methods prevents malicious manipulations. The proposed sampling uses data generators that learn the training set distribution and generate new perturbation instances much more similar to the training set. We show that the improved sampling increases the robustness of the LIME and SHAP, while previously untested method IME is already the most robust of all."
    },
    {
        "id": "2101.10785v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Marc Franzen, Michael Stephan Gresser, Tobias Müller, Sebastian Mauser",
        "title": "Developing emotion recognition for video conference software to support   people with autism",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "We develop an emotion recognition software for the use with a video conference software for autistic individuals which are unable to recognize emotions properly. It can get an image out of the video stream, detect the emotion in it with the help of a neural network and display the prediction to the user. The network is trained on facial landmark features. The software is fully modular to support adaption to different video conference software, programming languages and implementations."
    },
    {
        "id": "2101.10790v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Simon Meyer Lauritsen, Bo Thiesson, Marianne Johansson Jørgensen, Anders Hammerich Riis, Ulrick Skipper Espelund, Jesper Bo Weile, Jeppe Lange",
        "title": "The Consequences of the Framing of Machine Learning Risk Prediction   Models: Evaluation of Sepsis in General Wards",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Objectives: To evaluate the consequences of the framing of machine learning risk prediction models. We evaluate how framing affects model performance and model learning in four different approaches previously applied in published artificial-intelligence (AI) models.   Setting and participants: We analysed structured secondary healthcare data from 221,283 citizens from four Danish municipalities who were 18 years of age or older.   Results: The four models had similar population level performance (a mean area under the receiver operating characteristic curve of 0.73 to 0.82), in contrast to the mean average precision, which varied greatly from 0.007 to 0.385. Correspondingly, the percentage of missing values also varied between framing approaches. The on-clinical-demand framing, which involved samples for each time the clinicians made an early warning score assessment, showed the lowest percentage of missing values among the vital sign parameters, and this model was also able to learn more temporal dependencies than the others. The Shapley additive explanations demonstrated opposing interpretations of SpO2 in the prediction of sepsis as a consequence of differentially framed models.   Conclusions: The profound consequences of framing mandate attention from clinicians and AI developers, as the understanding and reporting of framing are pivotal to the successful development and clinical implementation of future AI technology. Model framing must reflect the expected clinical environment. The importance of proper problem framing is by no means exclusive to sepsis prediction and applies to most clinical risk prediction models."
    },
    {
        "id": "2101.10813v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Stephanie Rosenthal, Elizabeth J. Carter",
        "title": "Impact of Explanation on Trust of a Novel Mobile Robot",
        "comments": "9 pages, 3 figures",
        "journal-ref": "Proceedings of the AAAI Fall Symposium Series - Artificial\n  Intelligence for Human-Robot Interaction: Trust Explainability in Artificial\n  Intelligence for Human-Robot Interaction AI-HRI (AI-HRI '20), November 13-14,\n  2020, Washington DC, USA",
        "doi": null,
        "report-no": null,
        "categories": "cs.RO",
        "license": null,
        "abstract": "One challenge with introducing robots into novel environments is misalignment between supervisor expectations and reality, which can greatly affect a user's trust and continued use of the robot. We performed an experiment to test whether the presence of an explanation of expected robot behavior affected a supervisor's trust in an autonomous robot. We measured trust both subjectively through surveys and objectively through a dual-task experiment design to capture supervisors' neglect tolerance (i.e., their willingness to perform their own task while the robot is acting autonomously). Our objective results show that explanations can help counteract the novelty effect of seeing a new robot perform in an unknown environment. Participants who received an explanation of the robot's behavior were more likely to focus on their own task at the risk of neglecting their robot supervision task during the first trials of the robot's behavior compared to those who did not receive an explanation. However, this effect diminished after seeing multiple trials, and participants who received explanations were equally trusting of the robot's behavior as those who did not receive explanations. Interestingly, participants were not able to identify their own changes in trust through their survey responses, demonstrating that the dual-task design measured subtler changes in a supervisor's trust."
    },
    {
        "id": "2101.10892v2",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Gonçalo Cunha, Pedro Vicente, Alexandre Bernardino, Ricardo Ribeiro, Plínio Moreno",
        "title": "Online Body Schema Adaptation through Cost-Sensitive Active Learning",
        "comments": "6 pages, 7 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.RO",
        "license": null,
        "abstract": "Humanoid robots have complex bodies and kinematic chains with several Degrees-of-Freedom (DoF) which are difficult to model. Learning the parameters of a kinematic model can be achieved by observing the position of the robot links during prospective motions and minimising the prediction errors. This work proposes a movement efficient approach for estimating online the body-schema of a humanoid robot arm in the form of Denavit-Hartenberg (DH) parameters. A cost-sensitive active learning approach based on the A-Optimality criterion is used to select optimal joint configurations. The chosen joint configurations simultaneously minimise the error in the estimation of the body schema and minimise the movement between samples. This reduces energy consumption, along with mechanical fatigue and wear, while not compromising the learning accuracy. The work was implemented in a simulation environment, using the 7DoF arm of the iCub robot simulator. The hand pose is measured with a single camera via markers placed in the palm and back of the robot's hand. A non-parametric occlusion model is proposed to avoid choosing joint configurations where the markers are not visible, thus preventing worthless attempts. The results show cost-sensitive active learning has similar accuracy to the standard active learning approach, while reducing in about half the executed movement."
    },
    {
        "id": "2101.10917v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Christine de Kock, Andreas Vlachos",
        "title": "I Beg to Differ: A study of constructive disagreement in online   conversations",
        "comments": "Accepted to appear in EACL 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Disagreements are pervasive in human communication. In this paper we investigate what makes disagreement constructive. To this end, we construct WikiDisputes, a corpus of 7 425 Wikipedia Talk page conversations that contain content disputes, and define the task of predicting whether disagreements will be escalated to mediation by a moderator. We evaluate feature-based models with linguistic markers from previous work, and demonstrate that their performance is improved by using features that capture changes in linguistic markers throughout the conversations, as opposed to averaged values. We develop a variety of neural models and show that taking into account the structure of the conversation improves predictive accuracy, exceeding that of feature-based models. We assess our best neural model in terms of both predictive accuracy and uncertainty by evaluating its behaviour when it is only exposed to the beginning of the conversation, finding that model accuracy improves and uncertainty reduces as models are exposed to more information."
    },
    {
        "id": "2101.10953v3",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Wei Zhong Goh, Varun Ursekar, Marc W. Howard",
        "title": "Predicting the future with a scale-invariant temporal memory for the   past",
        "comments": "41 pages, 9 figures; authors' final version, accepted for publication\n  in Neural Computation",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "q-bio.NC",
        "license": null,
        "abstract": "In recent years it has become clear that the brain maintains a temporal memory of recent events stretching far into the past. This paper presents a neurally-inspired algorithm to use a scale-invariant temporal representation of the past to predict a scale-invariant future. The result is a scale-invariant estimate of future events as a function of the time at which they are expected to occur. The algorithm is time-local, with credit assigned to the present event by observing how it affects the prediction of the future. To illustrate the potential utility of this approach, we test the model on simultaneous renewal processes with different time scales. The algorithm scales well on these problems despite the fact that the number of states needed to describe them as a Markov process grows exponentially."
    },
    {
        "id": "2101.10964v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Oren Neumann, Claudius Gros",
        "title": "Investment vs. reward in a competitive knapsack problem",
        "comments": null,
        "journal-ref": "Learning Meets Combinatorial Algorithms at NeurIPS2020 (2020)",
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Natural selection drives species to develop brains, with sizes that increase with the complexity of the tasks to be tackled. Our goal is to investigate the balance between the metabolic costs of larger brains compared to the advantage they provide in solving general and combinatorial problems. Defining advantage as the performance relative to competitors, a two-player game based on the knapsack problem is used. Within this framework, two opponents compete over shared resources, with the goal of collecting more resources than the opponent. Neural nets of varying sizes are trained using a variant of the AlphaGo Zero algorithm. A surprisingly simple relation, $N_A/(N_A+N_B)$, is found for the relative win rate of a net with $N_A$ neurons against one with $N_B$. Success increases linearly with investments in additional resources when the networks sizes are very different, i.e. when $N_A \\ll N_B$, with returns diminishing when both networks become comparable in size."
    },
    {
        "id": "2102.04201v2",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Jennifer Cobbe, Michelle Seng Ah Lee, Jatinder Singh",
        "title": "Reviewable Automated Decision-Making: A Framework for Accountable   Algorithmic Systems",
        "comments": null,
        "journal-ref": "ACM Conference on Fairness, Accountability, and Transparency\n  (FAccT 21), March 2021, Virtual Event, Canada",
        "doi": null,
        "report-no": null,
        "categories": "cs.CY",
        "license": null,
        "abstract": "This paper introduces reviewability as a framework for improving the accountability of automated and algorithmic decision-making (ADM) involving machine learning. We draw on an understanding of ADM as a socio-technical process involving both human and technical elements, beginning before a decision is made and extending beyond the decision itself. While explanations and other model-centric mechanisms may assist some accountability concerns, they often provide insufficient information of these broader ADM processes for regulatory oversight and assessments of legal compliance. Reviewability involves breaking down the ADM process into technical and organisational elements to provide a systematic framework for determining the contextually appropriate record-keeping mechanisms to facilitate meaningful review - both of individual decisions and of the process as a whole. We argue that a reviewability framework, drawing on administrative law's approach to reviewing human decision-making, offers a practical way forward towards more a more holistic and legally-relevant form of accountability for ADM."
    },
    {
        "id": "2101.11023v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Taro Sakurai",
        "title": "On formal concepts of random formal contexts",
        "comments": "7 pages, 2 figures, 1 table",
        "journal-ref": "Information Sciences 578 (2021) 615-620",
        "doi": "10.1016/j.ins.2021.07.065",
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "In formal concept analysis, it is well-known that the number of formal concepts can be exponential in the worst case. To analyze the average case, we introduce a probabilistic model for random formal contexts and prove that the average number of formal concepts has a superpolynomial asymptotic lower bound."
    },
    {
        "id": "2101.11059v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Kailash Karthik Saravanakumar, Miguel Ballesteros, Muthu Kumar Chandrasekaran, Kathleen McKeown",
        "title": "Event-Driven News Stream Clustering using Entity-Aware Contextual   Embeddings",
        "comments": "To appear in Proceedings of The 16th Conference of the European\n  Chapter of the Association for Computational Linguistics",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "We propose a method for online news stream clustering that is a variant of the non-parametric streaming K-means algorithm. Our model uses a combination of sparse and dense document representations, aggregates document-cluster similarity along these multiple representations and makes the clustering decision using a neural classifier. The weighted document-cluster similarity model is learned using a novel adaptation of the triplet loss into a linear classification objective. We show that the use of a suitable fine-tuning objective and external knowledge in pre-trained transformer models yields significant improvements in the effectiveness of contextual embeddings for clustering. Our model achieves a new state-of-the-art on a standard stream clustering dataset of English documents."
    },
    {
        "id": "2101.11066v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "L. Aslanyan, V. Krasnoproshin, V. Ryazanov, H. Sahakyan",
        "title": "Logical-Combinatorial Approaches in Dynamic Recognition Problems",
        "comments": "research paper",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.DM",
        "license": null,
        "abstract": "A pattern recognition scenario, where instead of object classification into the classes by the learning set, the algorithm aims to allocate all objects to the same, the so-called normal class, is the research objective."
    },
    {
        "id": "2101.11071v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "William H. Guss, Mario Ynocente Castro, Sam Devlin, Brandon Houghton, Noboru Sean Kuno, Crissman Loomis, Stephanie Milani, Sharada Mohanty, Keisuke Nakata, Ruslan Salakhutdinov, John Schulman, Shinya Shiroshita, Nicholay Topin, Avinash Ummadisingu, Oriol Vinyals",
        "title": "The MineRL 2020 Competition on Sample Efficient Reinforcement Learning   using Human Priors",
        "comments": "37 pages, initial submission, accepted at NeurIPS. arXiv admin note:\n  substantial text overlap with arXiv:1904.10079",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Although deep reinforcement learning has led to breakthroughs in many difficult domains, these successes have required an ever-increasing number of samples, affording only a shrinking segment of the AI community access to their development. Resolution of these limitations requires new, sample-efficient methods. To facilitate research in this direction, we propose this second iteration of the MineRL Competition. The primary goal of the competition is to foster the development of algorithms which can efficiently leverage human demonstrations to drastically reduce the number of samples needed to solve complex, hierarchical, and sparse environments. To that end, participants compete under a limited environment sample-complexity budget to develop systems which solve the MineRL ObtainDiamond task in Minecraft, a sequential decision making environment requiring long-term planning, hierarchical control, and efficient exploration methods. The competition is structured into two rounds in which competitors are provided several paired versions of the dataset and environment with different game textures and shaders. At the end of each round, competitors submit containerized versions of their learning algorithms to the AIcrowd platform where they are trained from scratch on a hold-out dataset-environment pair for a total of 4-days on a pre-specified hardware platform. In this follow-up iteration to the NeurIPS 2019 MineRL Competition, we implement new features to expand the scale and reach of the competition. In response to the feedback of the previous participants, we introduce a second minor track focusing on solutions without access to environment interactions of any kind except during test-time. Further we aim to prompt domain agnostic submissions by implementing several novel competition mechanics including action-space randomization and desemantization of observations and actions."
    },
    {
        "id": "2101.11075v3",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Aaron Defazio, Samy Jelassi",
        "title": "Adaptivity without Compromise: A Momentumized, Adaptive, Dual Averaged   Gradient Method for Stochastic Optimization",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "We introduce MADGRAD, a novel optimization method in the family of AdaGrad adaptive gradient methods. MADGRAD shows excellent performance on deep learning optimization problems from multiple fields, including classification and image-to-image tasks in vision, and recurrent and bidirectionally-masked models in natural language processing. For each of these tasks, MADGRAD matches or outperforms both SGD and ADAM in test set performance, even on problems for which adaptive methods normally perform poorly."
    },
    {
        "id": "2102.00820v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Ali Mousavi, Mehrdad Jalali, Mahdi Yaghoubi",
        "title": "Adaptive Neuro Fuzzy Networks based on Quantum Subtractive Clustering",
        "comments": "Proceedings of the International Conference on Data Science\n  (IC-DATA), The Steering Committee of The World Congress in Computer Science,\n  Computer Engineering and Applied Computing (WorldComp), Nevada, USA, 2011",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Data mining techniques can be used to discover useful patterns by exploring and analyzing data and it's feasible to synergitically combine machine learning tools to discover fuzzy classification rules.In this paper, an adaptive Neuro fuzzy network with TSK fuzzy type and an improved quantum subtractive clustering has been developed. Quantum clustering (QC) is an intuition from quantum mechanics which uses Schrodinger potential and time-consuming gradient descent method. The principle advantage and shortcoming of QC is analyzed and based on its shortcomings, an improved algorithm through a subtractive clustering method is proposed. Cluster centers represent a general model with essential characteristics of data which can be use as premise part of fuzzy rules.The experimental results revealed that proposed Anfis based on quantum subtractive clustering yielded good approximation and generalization capabilities and impressive decrease in the number of fuzzy rules and network output accuracy in comparison with traditional methods."
    },
    {
        "id": "2101.11110v1",
        "submitter": null,
        "published": "2021-01-26",
        "authors": "Rohan Thakker, Nikhilesh Alatur, David D. Fan, Jesus Tordesillas, Michael Paton, Kyohei Otsu, Olivier Toupet, Ali-akbar Agha-mohammadi",
        "title": "Autonomous Off-road Navigation over Extreme Terrains with   Perceptually-challenging Conditions",
        "comments": "12 Pages, 7 Figures, 2020 International Symposium on Experimental\n  Robotics (ISER 2020)",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.RO",
        "license": null,
        "abstract": "We propose a framework for resilient autonomous navigation in perceptually challenging unknown environments with mobility-stressing elements such as uneven surfaces with rocks and boulders, steep slopes, negative obstacles like cliffs and holes, and narrow passages. Environments are GPS-denied and perceptually-degraded with variable lighting from dark to lit and obscurants (dust, fog, smoke). Lack of prior maps and degraded communication eliminates the possibility of prior or off-board computation or operator intervention. This necessitates real-time on-board computation using noisy sensor data. To address these challenges, we propose a resilient architecture that exploits redundancy and heterogeneity in sensing modalities. Further resilience is achieved by triggering recovery behaviors upon failure. We propose a fast settling algorithm to generate robust multi-fidelity traversability estimates in real-time. The proposed approach was deployed on multiple physical systems including skid-steer and tracked robots, a high-speed RC car and legged robots, as a part of Team CoSTAR's effort to the DARPA Subterranean Challenge, where the team won 2nd and 1st place in the Tunnel and Urban Circuits, respectively."
    },
    {
        "id": "2101.11155v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Sudhanshu Mishra, Shivangi Prasad, Shubhanshu Mishra",
        "title": "Exploring multi-task multi-lingual learning of transformer models for   hate speech and offensive speech identification in social media",
        "comments": "\"To be published in SN Computer Science at\n  https://doi.org/10.1007/s42979-021-00455-5\" \"30 pages, 6 figures\" \"Code\n  available at https://github.com/socialmediaie/MTML_HateSpeech\"",
        "journal-ref": null,
        "doi": "10.1007/s42979-021-00455-5",
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Hate Speech has become a major content moderation issue for online social media platforms. Given the volume and velocity of online content production, it is impossible to manually moderate hate speech related content on any platform. In this paper we utilize a multi-task and multi-lingual approach based on recently proposed Transformer Neural Networks to solve three sub-tasks for hate speech. These sub-tasks were part of the 2019 shared task on hate speech and offensive content (HASOC) identification in Indo-European languages. We expand on our submission to that competition by utilizing multi-task models which are trained using three approaches, a) multi-task learning with separate task heads, b) back-translation, and c) multi-lingual training. Finally, we investigate the performance of various models and identify instances where the Transformer based models perform differently and better. We show that it is possible to to utilize different combined approaches to obtain models that can generalize easily on different languages and tasks, while trading off slight accuracy (in some cases) for a much reduced inference time compute cost. We open source an updated version of our HASOC 2019 code with the new improvements at https://github.com/socialmediaie/MTML_HateSpeech."
    },
    {
        "id": "2101.11174v4",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Weiwei Jiang, Jiayun Luo",
        "title": "Graph Neural Network for Traffic Forecasting: A Survey",
        "comments": null,
        "journal-ref": "Expert Systems with Applications Volume, vol. 207, 30 November\n  2022, 117921",
        "doi": "10.1016/j.eswa.2022.117921",
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Traffic forecasting is important for the success of intelligent transportation systems. Deep learning models, including convolution neural networks and recurrent neural networks, have been extensively applied in traffic forecasting problems to model spatial and temporal dependencies. In recent years, to model the graph structures in transportation systems as well as contextual information, graph neural networks have been introduced and have achieved state-of-the-art performance in a series of traffic forecasting problems. In this survey, we review the rapidly growing body of research using different graph neural networks, e.g. graph convolutional and graph attention networks, in various traffic forecasting problems, e.g. road traffic flow and speed forecasting, passenger flow forecasting in urban rail transit systems, and demand forecasting in ride-hailing platforms. We also present a comprehensive list of open data and source resources for each problem and identify future research directions. To the best of our knowledge, this paper is the first comprehensive survey that explores the application of graph neural networks for traffic forecasting problems. We have also created a public GitHub repository where the latest papers, open data, and source resources will be updated."
    },
    {
        "id": "2101.11177v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Jacob Solawetz, Stefan Larson",
        "title": "LSOIE: A Large-Scale Dataset for Supervised Open Information Extraction",
        "comments": "EACL 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Open Information Extraction (OIE) systems seek to compress the factual propositions of a sentence into a series of n-ary tuples. These tuples are useful for downstream tasks in natural language processing like knowledge base creation, textual entailment, and natural language understanding. However, current OIE datasets are limited in both size and diversity. We introduce a new dataset by converting the QA-SRL 2.0 dataset to a large-scale OIE dataset (LSOIE). Our LSOIE dataset is 20 times larger than the next largest human-annotated OIE dataset. We construct and evaluate several benchmark OIE models on LSOIE, providing baselines for future improvements on the task. Our LSOIE data, models, and code are made publicly available"
    },
    {
        "id": "2102.01168v5",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Xin Chen, Guannan Qu, Yujie Tang, Steven Low, Na Li",
        "title": "Reinforcement Learning for Selective Key Applications in Power Systems:   Recent Advances and Future Challenges",
        "comments": null,
        "journal-ref": null,
        "doi": "10.1109/TSG.2022.3154718",
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "With large-scale integration of renewable generation and distributed energy resources, modern power systems are confronted with new operational challenges, such as growing complexity, increasing uncertainty, and aggravating volatility. Meanwhile, more and more data are becoming available owing to the widespread deployment of smart meters, smart sensors, and upgraded communication networks. As a result, data-driven control techniques, especially reinforcement learning (RL), have attracted surging attention in recent years. This paper provides a comprehensive review of various RL techniques and how they can be applied to decision-making and control in power systems. In particular, we select three key applications, i.e., frequency regulation, voltage control, and energy management, as examples to illustrate RL-based models and solutions. We then present the critical issues in the application of RL, i.e., safety, robustness, scalability, and data. Several potential future directions are discussed as well."
    },
    {
        "id": "2101.11204v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Jiaxin Bai, Hongming Zhang, Yangqiu Song, Kun Xu",
        "title": "Joint Coreference Resolution and Character Linking for Multiparty   Conversation",
        "comments": "EACL-2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Character linking, the task of linking mentioned people in conversations to the real world, is crucial for understanding the conversations. For the efficiency of communication, humans often choose to use pronouns (e.g., \"she\") or normal phrases (e.g., \"that girl\") rather than named entities (e.g., \"Rachel\") in the spoken language, which makes linking those mentions to real people a much more challenging than a regular entity linking task. To address this challenge, we propose to incorporate the richer context from the coreference relations among different mentions to help the linking. On the other hand, considering that finding coreference clusters itself is not a trivial task and could benefit from the global character information, we propose to jointly solve these two tasks. Specifically, we propose C$^2$, the joint learning model of Coreference resolution and Character linking. The experimental results demonstrate that C$^2$ can significantly outperform previous works on both tasks. Further analyses are conducted to analyze the contribution of all modules in the proposed model and the effect of all hyper-parameters."
    },
    {
        "id": "2101.11221v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Kwanyoung Park, Junseok Park, Hyunseok Oh, Byoung-Tak Zhang, Youngki Lee",
        "title": "Learning task-agnostic representation via toddler-inspired learning",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "One of the inherent limitations of current AI systems, stemming from the passive learning mechanisms (e.g., supervised learning), is that they perform well on labeled datasets but cannot deduce knowledge on their own. To tackle this problem, we derive inspiration from a highly intentional learning system via action: the toddler. Inspired by the toddler's learning procedure, we design an interactive agent that can learn and store task-agnostic visual representation while exploring and interacting with objects in the virtual environment. Experimental results show that such obtained representation was expandable to various vision tasks such as image classification, object localization, and distance estimation tasks. In specific, the proposed model achieved 100%, 75.1% accuracy and 1.62% relative error, respectively, which is noticeably better than autoencoder-based model (99.7%, 66.1%, 1.95%), and also comparable with those of supervised models (100%, 87.3%, 0.71%)."
    },
    {
        "id": "2103.11782v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Aidong Yang, Xinlang Yue, Ye Ouyang",
        "title": "Reinforcement Learning Assisted Beamforming for Inter-cell Interference   Mitigation in 5G Massive MIMO Networks",
        "comments": "There is an error in section 4 about what are the definitions of\n  states and actions, which will affect the performance of the algorithm",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.IT",
        "license": null,
        "abstract": "Beamforming is an essential technology in the 5G massive multiple-input-multiple-output (MMIMO) communications, which are subject to many impairments due to the nature of wireless transmission channel, i.e. the air. The inter-cell interference (ICI) is one of the main impairments faced by 5G communications due to frequency-reuse technologies. In this paper, we propose a reinforcement learning (RL) assisted full dynamic beamforming for ICI mitigation in 5G downlink. The proposed algorithm is a joint of beamforming and full dynamic Q-learning technology to minimize the ICI, and results in a low-complexity method without channel estimation. Performance analysis shows the quality of service improvement in terms of signal-to-interference-plus-noise-ratio (SINR) and computational complexity compared to other algorithms."
    },
    {
        "id": "2101.11253v4",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Sanghyun Jo, In-Jae Yu",
        "title": "Puzzle-CAM: Improved localization via matching partial and full features",
        "comments": "Accepted to ICIP 2021",
        "journal-ref": null,
        "doi": "10.1109/ICIP42928.2021.9506058",
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Weakly-supervised semantic segmentation (WSSS) is introduced to narrow the gap for semantic segmentation performance from pixel-level supervision to image-level supervision. Most advanced approaches are based on class activation maps (CAMs) to generate pseudo-labels to train the segmentation network. The main limitation of WSSS is that the process of generating pseudo-labels from CAMs that use an image classifier is mainly focused on the most discriminative parts of the objects. To address this issue, we propose Puzzle-CAM, a process that minimizes differences between the features from separate patches and the whole image. Our method consists of a puzzle module and two regularization terms to discover the most integrated region in an object. Puzzle-CAM can activate the overall region of an object using image-level supervision without requiring extra parameters. % In experiments, Puzzle-CAM outperformed previous state-of-the-art methods using the same labels for supervision on the PASCAL VOC 2012 test dataset. In experiments, Puzzle-CAM outperformed previous state-of-the-art methods using the same labels for supervision on the PASCAL VOC 2012 dataset. Code associated with our experiments is available at https://github.com/OFRIN/PuzzleCAM."
    },
    {
        "id": "2101.11260v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Natasa Vodopivec, Carole Adam, Jean-Pierre Chanteau",
        "title": "Modeling opinion leader's role in the diffusion of innovation",
        "comments": "Internship report",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.SI",
        "license": null,
        "abstract": "The diffusion of innovations is an important topic for the consumer markets. Early research focused on how innovations spread on the level of the whole society. To get closer to the real world scenarios agent based models (ABM) started focusing on individual-level agents. In our work we will translate an existing ABM that investigates the role of opinion leaders in the process of diffusion of innovations to a new, more expressive platform designed for agent based modeling, GAMA. We will do it to show that taking advantage of new features of the chosen platform should be encouraged when making models in the field of social sciences in the future, because it can be beneficial for the explanatory power of simulation results."
    },
    {
        "id": "2101.11266v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Tomasz Szandala",
        "title": "TorchPRISM: Principal Image Sections Mapping, a novel method for   Convolutional Neural Network features visualization",
        "comments": "Very early draft, software can be found:\n  https://github.com/szandala/TorchPRISM",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "In this paper we introduce a tool called Principal Image Sections Mapping - PRISM, dedicated for PyTorch, but can be easily ported to other deep learning frameworks. Presented software relies on Principal Component Analysis to visualize the most significant features recognized by a given Convolutional Neural Network. Moreover, it allows to display comparative set features between images processed in the same batch, therefore PRISM can be a method well synerging with technique Explanation by Example."
    },
    {
        "id": "2101.11268v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Suyuchen Wang, Ruihui Zhao, Xi Chen, Yefeng Zheng, Bang Liu",
        "title": "Enquire One's Parent and Child Before Decision: Fully Exploit   Hierarchical Structure for Self-Supervised Taxonomy Expansion",
        "comments": "12 pages, 6 figures. To appear in The Web Conference (WWW) 2021",
        "journal-ref": null,
        "doi": "10.1145/3442381.3449948",
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Taxonomy is a hierarchically structured knowledge graph that plays a crucial role in machine intelligence. The taxonomy expansion task aims to find a position for a new term in an existing taxonomy to capture the emerging knowledge in the world and keep the taxonomy dynamically updated. Previous taxonomy expansion solutions neglect valuable information brought by the hierarchical structure and evaluate the correctness of merely an added edge, which downgrade the problem to node-pair scoring or mini-path classification. In this paper, we propose the Hierarchy Expansion Framework (HEF), which fully exploits the hierarchical structure's properties to maximize the coherence of expanded taxonomy. HEF makes use of taxonomy's hierarchical structure in multiple aspects: i) HEF utilizes subtrees containing most relevant nodes as self-supervision data for a complete comparison of parental and sibling relations; ii) HEF adopts a coherence modeling module to evaluate the coherence of a taxonomy's subtree by integrating hypernymy relation detection and several tree-exclusive features; iii) HEF introduces the Fitting Score for position selection, which explicitly evaluates both path and level selections and takes full advantage of parental relations to interchange information for disambiguation and self-correction. Extensive experiments show that by better exploiting the hierarchical structure and optimizing taxonomy's coherence, HEF vastly surpasses the prior state-of-the-art on three benchmark datasets by an average improvement of 46.7% in accuracy and 32.3% in mean reciprocal rank."
    },
    {
        "id": "2101.11296v3",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Yiying Li, Wei Zhou, Huaimin Wang, Haibo Mi, Timothy M. Hospedales",
        "title": "FedH2L: Federated Learning with Model and Statistical Heterogeneity",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Federated learning (FL) enables distributed participants to collectively learn a strong global model without sacrificing their individual data privacy. Mainstream FL approaches require each participant to share a common network architecture and further assume that data are are sampled IID across participants. However, in real-world deployments participants may require heterogeneous network architectures; and the data distribution is almost certainly non-uniform across participants. To address these issues we introduce FedH2L, which is agnostic to both the model architecture and robust to different data distributions across participants. In contrast to approaches sharing parameters or gradients, FedH2L relies on mutual distillation, exchanging only posteriors on a shared seed set between participants in a decentralized manner. This makes it extremely bandwidth efficient, model agnostic, and crucially produces models capable of performing well on the whole data distribution when learning from heterogeneous silos."
    },
    {
        "id": "2101.11306v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Shuo-Hui Li",
        "title": "Learning Non-linear Wavelet Transformation via Normalizing Flow",
        "comments": "Main text: 8 pages, 4 figures. Supplement: 9 pages, 2 figures. Github\n  link: https://github.com/li012589/NeuralWavelet",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Wavelet transformation stands as a cornerstone in modern data analysis and signal processing. Its mathematical essence is an invertible transformation that discerns slow patterns from fast ones in the frequency domain. Such an invertible transformation can be learned by a designed normalizing flow model. With a generalized lifting scheme as coupling layers, a factor-out layer resembling the downsampling, and parameter sharing at different levels of the model, one can train the normalizing flow to filter high-frequency elements at different levels, thus extending traditional linear wavelet transformations to learnable non-linear deep learning models. In this paper, a way of building such flow is proposed, along with a numerical analysis of the learned transformation. Then, we demonstrate the model's ability in image lossless compression, show it can achieve SOTA compression scores while achieving a small model size, substantial generalization ability, and the ability to handle high-dimensional data."
    },
    {
        "id": "2101.11351v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Dario Stein, Sam Staton",
        "title": "Compositional Semantics for Probabilistic Programs with Exact   Conditioning",
        "comments": "16 pages, 5 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.PL",
        "license": null,
        "abstract": "We define a probabilistic programming language for Gaussian random variables with a first-class exact conditioning construct. We give operational, denotational and equational semantics for this language, establishing convenient properties like exchangeability of conditions. Conditioning on equality of continuous random variables is nontrivial, as the exact observation may have probability zero; this is Borel's paradox. Using categorical formulations of conditional probability, we show that the good properties of our language are not particular to Gaussians, but can be derived from universal properties, thus generalizing to wider settings. We define the Cond construction, which internalizes conditioning as a morphism, providing general compositional semantics for probabilistic programming with exact conditioning."
    },
    {
        "id": "2101.11354v3",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Yongchun Zhu, Fuzhen Zhuang, Xiangliang Zhang, Zhiyuan Qi, Zhiping Shi, Juan Cao, Qing He",
        "title": "Combat Data Shift in Few-shot Learning with Knowledge Graph",
        "comments": "Frontiers of Computer Science regular paper. 18 pages, 3 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Many few-shot learning approaches have been designed under the meta-learning framework, which learns from a variety of learning tasks and generalizes to new tasks. These meta-learning approaches achieve the expected performance in the scenario where all samples are drawn from the same distributions (i.i.d. observations). However, in real-world applications, few-shot learning paradigm often suffers from data shift, i.e., samples in different tasks, even in the same task, could be drawn from various data distributions. Most existing few-shot learning approaches are not designed with the consideration of data shift, and thus show downgraded performance when data distribution shifts. However, it is non-trivial to address the data shift problem in few-shot learning, due to the limited number of labeled samples in each task. Targeting at addressing this problem, we propose a novel metric-based meta-learning framework to extract task-specific representations and task-shared representations with the help of knowledge graph. The data shift within/between tasks can thus be combated by the combination of task-shared and task-specific representations. The proposed model is evaluated on popular benchmarks and two constructed new challenging datasets. The evaluation results demonstrate its remarkable performance."
    },
    {
        "id": "2101.11374v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Yichao Du, Pengfei Luo, Xudong Hong, Tong Xu, Zhe Zhang, Chao Ren, Yi Zheng, Enhong Chen",
        "title": "Inheritance-guided Hierarchical Assignment for Clinical Automatic   Diagnosis",
        "comments": "17 pages, 5 figures, DASFAA 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Clinical diagnosis, which aims to assign diagnosis codes for a patient based on the clinical note, plays an essential role in clinical decision-making. Considering that manual diagnosis could be error-prone and time-consuming, many intelligent approaches based on clinical text mining have been proposed to perform automatic diagnosis. However, these methods may not achieve satisfactory results due to the following challenges. First, most of the diagnosis codes are rare, and the distribution is extremely unbalanced. Second, existing methods are challenging to capture the correlation between diagnosis codes. Third, the lengthy clinical note leads to the excessive dispersion of key information related to codes. To tackle these challenges, we propose a novel framework to combine the inheritance-guided hierarchical assignment and co-occurrence graph propagation for clinical automatic diagnosis. Specifically, we propose a hierarchical joint prediction strategy to address the challenge of unbalanced codes distribution. Then, we utilize graph convolutional neural networks to obtain the correlation and semantic representations of medical ontology. Furthermore, we introduce multi attention mechanisms to extract crucial information. Finally, extensive experiments on MIMIC-III dataset clearly validate the effectiveness of our method."
    },
    {
        "id": "2101.11376v3",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Charles Wilmot, Gianluca Baldassarre, Jochen Triesch",
        "title": "Learning Abstract Representations through Lossy Compression of   Multi-Modal Signals",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "A key competence for open-ended learning is the formation of increasingly abstract representations useful for driving complex behavior. Abstract representations ignore specific details and facilitate generalization. Here we consider the learning of abstract representations in a multi-modal setting with two or more input modalities. We treat the problem as a lossy compression problem and show that generic lossy compression of multimodal sensory input naturally extracts abstract representations that tend to strip away modalitiy specific details and preferentially retain information that is shared across the different modalities. Furthermore, we propose an architecture to learn abstract representations by identifying and retaining only the information that is shared across multiple modalities while discarding any modality specific information."
    },
    {
        "id": "2101.11391v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Charles Wilmot, Bertram E. Shi, Jochen Triesch",
        "title": "Self-Calibrating Active Binocular Vision via Active Efficient Coding   with Deep Autoencoders",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "We present a model of the self-calibration of active binocular vision comprising the simultaneous learning of visual representations, vergence, and pursuit eye movements. The model follows the principle of Active Efficient Coding (AEC), a recent extension of the classic Efficient Coding Hypothesis to active perception. In contrast to previous AEC models, the present model uses deep autoencoders to learn sensory representations. We also propose a new formulation of the intrinsic motivation signal that guides the learning of behavior. We demonstrate the performance of the model in simulations."
    },
    {
        "id": "2101.11453v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Jan Hendrik Metzen, Nicole Finnie, Robin Hutmacher",
        "title": "Meta Adversarial Training against Universal Patches",
        "comments": "Accepted by the ICML 2021 workshop on \"A Blessing in Disguise: The\n  Prospects and Perils of Adversarial Machine Learning\"",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Recently demonstrated physical-world adversarial attacks have exposed vulnerabilities in perception systems that pose severe risks for safety-critical applications such as autonomous driving. These attacks place adversarial artifacts in the physical world that indirectly cause the addition of a universal patch to inputs of a model that can fool it in a variety of contexts. Adversarial training is the most effective defense against image-dependent adversarial attacks. However, tailoring adversarial training to universal patches is computationally expensive since the optimal universal patch depends on the model weights which change during training. We propose meta adversarial training (MAT), a novel combination of adversarial training with meta-learning, which overcomes this challenge by meta-learning universal patches along with model training. MAT requires little extra computation while continuously adapting a large set of patches to the current model. MAT considerably increases robustness against universal patch attacks on image classification and traffic-light detection."
    },
    {
        "id": "2101.11473v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Lin Xie, Hanyi Li, Laurin Luttmann",
        "title": "Formulating and solving integrated order batching and routing in   multi-depot AGV-assisted mixed-shelves warehouses",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "math.OC",
        "license": null,
        "abstract": "Different retail and e-commerce companies are facing the challenge of assembling large numbers of time-critical picking orders that include both small-line and multi-line orders. To reduce unproductive picker working time as in traditional picker-to-parts warehousing systems, different solutions are proposed in the literature and in practice. For example, in a mixed-shelves storage policy, items of the same stock keeping unit are spread over several shelves in a warehouse; or automated guided vehicles (AGVs) are used to transport the picked items from the storage area to packing stations instead of human pickers. This is the first paper to combine both solutions, creating what we call AGV-assisted mixed-shelves picking systems. We model the new integrated order batching and routing problem in such systems as an extended multi-depot vehicle routing problem with both three-index and two-commodity network flow formulations. Due to the complexity of the integrated problem, we develop a novel variable neighborhood search algorithm to solve the integrated problem more efficiently. We test our methods with different sizes of instances, and conclude that the mixed-shelves storage policy is more suitable than the usual storage policy in AGV-assisted mixed-shelves systems for orders with different sizes of order lines (saving up to 62% on driving distances for AGVs). Our variable neighborhood search algorithm provides optimal solutions within an acceptable computational time."
    },
    {
        "id": "2101.11496v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Song-Ju Kim, Taiki Takahashi, Kazuo Sano",
        "title": "A Balance for Fairness: Fair Distribution Utilising Physics in Games of   Characteristic Function Form",
        "comments": "13 pages, 5 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.GT",
        "license": null,
        "abstract": "In chaotic modern society, there is an increasing demand for the realization of true 'fairness'. In Greek mythology, Themis, the 'goddess of justice', has a sword in her right hand to protect society from vices, and a 'balance of judgment' in her left hand that measures good and evil. In this study, we propose a fair distribution method 'utilising physics' for the profit in games of characteristic function form. Specifically, we show that the linear programming problem for calculating 'nucleolus' can be efficiently solved by considering it as a physical system in which gravity works. In addition to being able to significantly reduce computational complexity thereby, we believe that this system could have flexibility necessary to respond to real-time changes in the parameter."
    },
    {
        "id": "2101.11501v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Emmanuel Adetiba, Temitope John, Adekunle Akinrinmade, Funmilayo Moninuola, Oladipupo Akintade, Joke Badejo",
        "title": "Evolution of artificial intelligence languages, a systematic literature   review",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "The field of Artificial Intelligence (AI) has undoubtedly received significant attention in recent years. AI is being adopted to provide solutions to problems in fields such as medicine, engineering, education, government and several other domains. In order to analyze the state of the art of research in the field of AI, we present a systematic literature review focusing on the Evolution of AI programming languages. We followed the systematic literature review method by searching relevant databases like SCOPUS, IEEE Xplore and Google Scholar. EndNote reference manager was used to catalog the relevant extracted papers. Our search returned a total of 6565 documents, whereof 69 studies were retained. Of the 69 retained studies, 15 documents discussed LISP programming language, another 34 discussed PROLOG programming language, the remaining 20 documents were spread between Logic and Object Oriented Programming (LOOP), ARCHLOG, Epistemic Ontology Language with Constraints (EOLC), Python, C++, ADA and JAVA programming languages. This review provides information on the year of implementation, development team, capabilities, limitations and applications of each of the AI programming languages discussed. The information in this review could guide practitioners and researchers in AI to make the right choice of languages to implement their novel AI methods."
    },
    {
        "id": "2101.12031v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Hemant Rathore, Sanjay K. Sahay, Piyush Nikam, Mohit Sewak",
        "title": "Robust Android Malware Detection System against Adversarial Attacks   using Q-Learning",
        "comments": "Inf Syst Front (2020)",
        "journal-ref": null,
        "doi": "10.1007/s10796-020-10083-8",
        "report-no": null,
        "categories": "cs.CR",
        "license": null,
        "abstract": "The current state-of-the-art Android malware detection systems are based on machine learning and deep learning models. Despite having superior performance, these models are susceptible to adversarial attacks. Therefore in this paper, we developed eight Android malware detection models based on machine learning and deep neural network and investigated their robustness against adversarial attacks. For this purpose, we created new variants of malware using Reinforcement Learning, which will be misclassified as benign by the existing Android malware detection models. We propose two novel attack strategies, namely single policy attack and multiple policy attack using reinforcement learning for white-box and grey-box scenario respectively. Putting ourselves in the adversary's shoes, we designed adversarial attacks on the detection models with the goal of maximizing fooling rate, while making minimum modifications to the Android application and ensuring that the app's functionality and behavior do not change. We achieved an average fooling rate of 44.21% and 53.20% across all the eight detection models with a maximum of five modifications using a single policy attack and multiple policy attack, respectively. The highest fooling rate of 86.09% with five changes was attained against the decision tree-based model using the multiple policy approach. Finally, we propose an adversarial defense strategy that reduces the average fooling rate by threefold to 15.22% against a single policy attack, thereby increasing the robustness of the detection models i.e. the proposed model can effectively detect variants (metamorphic) of malware. The experimental analysis shows that our proposed Android malware detection system using reinforcement learning is more robust against adversarial attacks."
    },
    {
        "id": "2101.11538v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Albin Soutif, Carole Adam, Sylvain Bouveret",
        "title": "Multi-agent simulation of voter's behaviour",
        "comments": "internship report",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.MA",
        "license": null,
        "abstract": "The goal of this paper is to simulate the voters behaviour given a voting method. Our approach uses a multi-agent simulation in order to model a voting process through many iterations, so that the voters can vote by taking into account the results of polls. Here we only tried basic rules and a single voting method, but further attempts could explore new features."
    },
    {
        "id": "2101.11548v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Yassine Bouachrine, Carole Adam",
        "title": "Modelling the Impact of Scandals: the case of the 2017 French   Presidential Election",
        "comments": "internship report",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.MA",
        "license": null,
        "abstract": "This paper proposes an agent-based simulation of a presidential election, inspired by the French 2017 presidential election. The simulation is based on data extracted from polls, media coverage, and Twitter. The main contribution is to consider the impact of scandals and media bashing on the result of the election. In particular, it is shown that scandals can lead to higher abstention at the election, as voters have no relevant candidate left to vote for. The simulation is implemented in Unity 3D and is available to play online."
    },
    {
        "id": "2101.11550v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Shin-nosuke Ishikawa, Hideaki Matsumura, Yasunobu Uchiyama, Lindsay Glesener",
        "title": "Automatic Detection of Occulted Hard X-ray Flares Using Deep-Learning   Methods",
        "comments": "11 pages, 3 figures, accepted for publication in Solar Physics",
        "journal-ref": null,
        "doi": "10.1007/s11207-021-01780-x",
        "report-no": null,
        "categories": "astro-ph.SR",
        "license": null,
        "abstract": "We present a concept for a machine-learning classification of hard X-ray (HXR) emissions from solar flares observed by the Reuven Ramaty High Energy Solar Spectroscopic Imager (RHESSI), identifying flares that are either occulted by the solar limb or located on the solar disk. Although HXR observations of occulted flares are important for particle-acceleration studies, HXR data analyses for past observations were time consuming and required specialized expertise. Machine-learning techniques are promising for this situation, and we constructed a sample model to demonstrate the concept using a deep-learning technique. Input data to the model are HXR spectrograms that are easily produced from RHESSI data. The model can detect occulted flares without the need for image reconstruction nor for visual inspection by experts. A technique of convolutional neural networks was used in this model by regarding the input data as images. Our model achieved a classification accuracy better than 90 %, and the ability for the application of the method to either event screening or for an event alert for occulted flares was successfully demonstrated."
    },
    {
        "id": "2101.11560v4",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Ece Calikus, Slawomir Nowaczyk, Mohamed-Rafik Bouguelia, Onur Dikmen",
        "title": "Wisdom of the Contexts: Active Ensemble Learning for Contextual Anomaly   Detection",
        "comments": null,
        "journal-ref": "Data Mining Knowledge Discovery (2022)",
        "doi": "10.1007/s10618-022-00868-7",
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "In contextual anomaly detection, an object is only considered anomalous within a specific context. Most existing methods for CAD use a single context based on a set of user-specified contextual features. However, identifying the right context can be very challenging in practice, especially in datasets, with a large number of attributes. Furthermore, in real-world systems, there might be multiple anomalies that occur in different contexts and, therefore, require a combination of several \"useful\" contexts to unveil them. In this work, we leverage active learning and ensembles to effectively detect complex contextual anomalies in situations where the true contextual and behavioral attributes are unknown. We propose a novel approach, called WisCon (Wisdom of the Contexts), that automatically creates contexts from the feature set. Our method constructs an ensemble of multiple contexts, with varying importance scores, based on the assumption that not all useful contexts are equally so. Experiments show that WisCon significantly outperforms existing baselines in different categories (i.e., active classifiers, unsupervised contextual and non-contextual anomaly detectors, and supervised classifiers) on seven datasets. Furthermore, the results support our initial hypothesis that there is no single perfect context that successfully uncovers all kinds of contextual anomalies, and leveraging the \"wisdom\" of multiple contexts is necessary."
    },
    {
        "id": "2101.11563v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Rashmiranjan Das, Gaurav Negi, Alan F. Smeaton",
        "title": "Detecting Deepfake Videos Using Euler Video Magnification",
        "comments": "Presented at Electronic Imaging: Media Watermarking, Security, and\n  Forensics, 27 January 2021, 6 pages, 6 figures",
        "journal-ref": null,
        "doi": "10.2352/ISSN.2470-1173.2021.4.MWSF-272",
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Recent advances in artificial intelligence make it progressively hard to distinguish between genuine and counterfeit media, especially images and videos. One recent development is the rise of deepfake videos, based on manipulating videos using advanced machine learning techniques. This involves replacing the face of an individual from a source video with the face of a second person, in the destination video. This idea is becoming progressively refined as deepfakes are getting progressively seamless and simpler to compute. Combined with the outreach and speed of social media, deepfakes could easily fool individuals when depicting someone saying things that never happened and thus could persuade people in believing fictional scenarios, creating distress, and spreading fake news. In this paper, we examine a technique for possible identification of deepfake videos. We use Euler video magnification which applies spatial decomposition and temporal filtering on video data to highlight and magnify hidden features like skin pulsation and subtle motions. Our approach uses features extracted from the Euler technique to train three models to classify counterfeit and unaltered videos and compare the results with existing techniques."
    },
    {
        "id": "2101.11566v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Antony Thomas, Fulvio Mastrogiovanni, Marco Baglietto",
        "title": "An Integrated Localisation, Motion Planning and Obstacle Avoidance   Algorithm in Belief Space",
        "comments": "Accepted for publication in Intelligent Service Robotics",
        "journal-ref": null,
        "doi": "10.1007/s11370-021-00359-6",
        "report-no": null,
        "categories": "cs.RO",
        "license": null,
        "abstract": "As robots are being increasingly used in close proximity to humans and objects, it is imperative that robots operate safely and efficiently under real-world conditions. Yet, the environment is seldom known perfectly. Noisy sensors and actuation errors compound to the errors introduced while estimating features of the environment. We present a novel approach (1) to incorporate these uncertainties for robot state estimation and (2) to compute the probability of collision pertaining to the estimated robot configurations. The expression for collision probability is obtained as an infinite series and we prove its convergence. An upper bound for the truncation error is also derived and the number of terms required is demonstrated by analyzing the convergence for different robot and obstacle configurations. We evaluate our approach using two simulation domains which use a roadmap-based strategy to synthesize trajectories that satisfy collision probability bounds."
    },
    {
        "id": "2101.11574v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Jiaqi Wu, Weihua Li, Quan Bai, Takayuki Ito, Ahmed Moustafa",
        "title": "Privacy Information Classification: A Hybrid Approach",
        "comments": "IJCAI 2019 Workshop. The 4th International Workshop on Smart\n  Simulation and Modelling for Complex Systems",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "A large amount of information has been published to online social networks every day. Individual privacy-related information is also possibly disclosed unconsciously by the end-users. Identifying privacy-related data and protecting the online social network users from privacy leakage turn out to be significant. Under such a motivation, this study aims to propose and develop a hybrid privacy classification approach to detect and classify privacy information from OSNs. The proposed hybrid approach employs both deep learning models and ontology-based models for privacy-related information extraction. Extensive experiments are conducted to validate the proposed hybrid approach, and the empirical results demonstrate its superiority in assisting online social network users against privacy leakage."
    },
    {
        "id": "2102.00818v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Frank Hannig, Paolo Meloni, Matteo Spallanzani, Matthias Ziegler",
        "title": "Proceedings of the DATE Friday Workshop on System-level Design Methods   for Deep Learning on Heterogeneous Architectures (SLOHA 2021)",
        "comments": "Website of the workshop: https://www12.cs.fau.de/ws/sloha2021/",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AR",
        "license": null,
        "abstract": "This volume contains the papers accepted at the first DATE Friday Workshop on System-level Design Methods for Deep Learning on Heterogeneous Architectures (SLOHA 2021), held virtually on February 5, 2021. SLOHA 2021 was co-located with the Conference on Design, Automation and Test in Europe (DATE)."
    },
    {
        "id": "2101.11587v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Steven J. Frank",
        "title": "The Work of Art in an Age of Mechanical Generation",
        "comments": "This is the author's final version; the article has been accepted for\n  publication in Leonardo Journal",
        "journal-ref": "Leonardo(2022) 55(4): 378-381",
        "doi": "10.1162/leon_a_02095",
        "report-no": null,
        "categories": "cs.CY",
        "license": null,
        "abstract": "Can we define what it means to be \"creative,\" and if so, can our definition drive artificial intelligence (AI) systems to feats of creativity indistinguishable from human efforts? This mixed question is considered from technological and social perspectives. Beginning with an exploration of the value we attach to authenticity in works of art, the article considers the ability of AI to detect forgeries of renowned paintings and, in so doing, somehow reveal the quiddity of a work of art. We conclude by considering whether evolving technical capability can revise traditional relationships among art, artist, and the market."
    },
    {
        "id": "2101.11605v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Aravind Srinivas, Tsung-Yi Lin, Niki Parmar, Jonathon Shlens, Pieter Abbeel, Ashish Vaswani",
        "title": "Bottleneck Transformers for Visual Recognition",
        "comments": "Technical Report, 20 pages, 13 figures, 19 tables",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "We present BoTNet, a conceptually simple yet powerful backbone architecture that incorporates self-attention for multiple computer vision tasks including image classification, object detection and instance segmentation. By just replacing the spatial convolutions with global self-attention in the final three bottleneck blocks of a ResNet and no other changes, our approach improves upon the baselines significantly on instance segmentation and object detection while also reducing the parameters, with minimal overhead in latency. Through the design of BoTNet, we also point out how ResNet bottleneck blocks with self-attention can be viewed as Transformer blocks. Without any bells and whistles, BoTNet achieves 44.4% Mask AP and 49.7% Box AP on the COCO Instance Segmentation benchmark using the Mask R-CNN framework; surpassing the previous best published single model and single scale results of ResNeSt evaluated on the COCO validation set. Finally, we present a simple adaptation of the BoTNet design for image classification, resulting in models that achieve a strong performance of 84.7% top-1 accuracy on the ImageNet benchmark while being up to 1.64x faster in compute time than the popular EfficientNet models on TPU-v3 hardware. We hope our simple and effective approach will serve as a strong baseline for future research in self-attention models for vision"
    },
    {
        "id": "2101.12208v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Maritza Tynes, Mahboobeh Parsapoor",
        "title": "Meta-learning on Spectral Images of Electroencephalogram of   Schizophenics",
        "comments": "Withdrawn by arXiv administrators as co-author did not consent to\n  submit",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Schizophrenia is a complex psychiatric disorder involving changes in thought patterns, perception, mood, and behavior. The diagnosis of schizophrenia is challenging and requires that patients show two or more positive symptoms for at least one month. Delays in identifying this debilitating disorder can impede a patient ability to receive much needed treatment. Advances in neuroimaging and machine learning algorithms can facilitate the diagnosis of schizophrenia and help clinicians to provide an accurate diagnosis of the disease. This paper presents a methodology for analyzing spectral images of Electroencephalography collected from patients with schizophrenia using convolutional neural networks. It also explains how we have developed accurate classifiers employing Model-Agnostic Meta-Learning and prototypical networks. Such classifiers have the capacity to distinguish people with schizophrenia from healthy controls based on their brain activity."
    },
    {
        "id": "2101.11685v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Rasul Karimov, Yury Malkov, Karim Iskakov, Victor Lempitsky",
        "title": "CNN with large memory layers",
        "comments": "Master's dissertation paper",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "This work is centred around the recently proposed product key memory structure \\cite{large_memory}, implemented for a number of computer vision applications. The memory structure can be regarded as a simple computation primitive suitable to be augmented to nearly all neural network architectures. The memory block allows implementing sparse access to memory with square root complexity scaling with respect to the memory capacity. The latter scaling is possible due to the incorporation of Cartesian product space decomposition of the key space for the nearest neighbour search. We have tested the memory layer on the classification, image reconstruction and relocalization problems and found that for some of those, the memory layers can provide significant speed/accuracy improvement with the high utilization of the key-value elements, while others require more careful fine-tuning and suffer from dying keys. To tackle the later problem we have introduced a simple technique of memory re-initialization which helps us to eliminate unused key-value pairs from the memory and engage them in training again. We have conducted various experiments and got improvements in speed and accuracy for classification and PoseNet relocalization models.   We showed that the re-initialization has a huge impact on a toy example of randomly labeled data and observed some gains in performance on the image classification task. We have also demonstrated the generalization property perseverance of the large memory layers on the relocalization problem, while observing the spatial correlations between the images and the selected memory cells."
    },
    {
        "id": "2101.11700v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Zhenyu Lei, Yejing Xie, Suiyi Ling, Andreas Pastor, Junle Wang, Patrick Le Callet",
        "title": "Multi-Modal Aesthetic Assessment for MObile Gaming Image",
        "comments": "5 pages",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "With the proliferation of various gaming technology, services, game styles, and platforms, multi-dimensional aesthetic assessment of the gaming contents is becoming more and more important for the gaming industry. Depending on the diverse needs of diversified game players, game designers, graphical developers, etc. in particular conditions, multi-modal aesthetic assessment is required to consider different aesthetic dimensions/perspectives. Since there are different underlying relationships between different aesthetic dimensions, e.g., between the `Colorfulness' and `Color Harmony', it could be advantageous to leverage effective information attached in multiple relevant dimensions. To this end, we solve this problem via multi-task learning. Our inclination is to seek and learn the correlations between different aesthetic relevant dimensions to further boost the generalization performance in predicting all the aesthetic dimensions. Therefore, the `bottleneck' of obtaining good predictions with limited labeled data for one individual dimension could be unplugged by harnessing complementary sources of other dimensions, i.e., augment the training data indirectly by sharing training information across dimensions. According to experimental results, the proposed model outperforms state-of-the-art aesthetic metrics significantly in predicting four gaming aesthetic dimensions."
    },
    {
        "id": "2101.11707v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Kinjal Basu, Sarat Varanasi, Farhad Shakerin, Joaquin Arias, Gopal Gupta",
        "title": "Knowledge-driven Natural Language Understanding of English Text and its   Applications",
        "comments": "Preprint. Accepted by the 35th AAAI Conference (AAAI-21) Main Tracks",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Understanding the meaning of a text is a fundamental challenge of natural language understanding (NLU) research. An ideal NLU system should process a language in a way that is not exclusive to a single task or a dataset. Keeping this in mind, we have introduced a novel knowledge driven semantic representation approach for English text. By leveraging the VerbNet lexicon, we are able to map syntax tree of the text to its commonsense meaning represented using basic knowledge primitives. The general purpose knowledge represented from our approach can be used to build any reasoning based NLU system that can also provide justification. We applied this approach to construct two NLU applications that we present here: SQuARE (Semantic-based Question Answering and Reasoning Engine) and StaCACK (Stateful Conversational Agent using Commonsense Knowledge). Both these systems work by \"truly understanding\" the natural language text they process and both provide natural language explanations for their responses while maintaining high accuracy."
    },
    {
        "id": "2101.11718v1",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Jwala Dhamala, Tony Sun, Varun Kumar, Satyapriya Krishna, Yada Pruksachatkun, Kai-Wei Chang, Rahul Gupta",
        "title": "BOLD: Dataset and Metrics for Measuring Biases in Open-Ended Language   Generation",
        "comments": null,
        "journal-ref": null,
        "doi": "10.1145/3442188.3445924",
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Recent advances in deep learning techniques have enabled machines to generate cohesive open-ended text when prompted with a sequence of words as context. While these models now empower many downstream applications from conversation bots to automatic storytelling, they have been shown to generate texts that exhibit social biases. To systematically study and benchmark social biases in open-ended language generation, we introduce the Bias in Open-Ended Language Generation Dataset (BOLD), a large-scale dataset that consists of 23,679 English text generation prompts for bias benchmarking across five domains: profession, gender, race, religion, and political ideology. We also propose new automated metrics for toxicity, psycholinguistic norms, and text gender polarity to measure social biases in open-ended text generation from multiple angles. An examination of text generated from three popular language models reveals that the majority of these models exhibit a larger social bias than human-written Wikipedia text across all domains. With these results we highlight the need to benchmark biases in open-ended language generation and caution users of language generation models on downstream tasks to be cognizant of these embedded prejudices."
    },
    {
        "id": "2101.11727v2",
        "submitter": null,
        "published": "2021-01-27",
        "authors": "Cristina Feier",
        "title": "Characterising Fixed Parameter Tractability of Query Evaluation over   Guarded TGDs",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LO",
        "license": null,
        "abstract": "We study the parameterized complexity of evaluating Ontology Mediated Queries (OMQs) based on Guarded TGDs (GTGDs) and Unions of Conjunctive Queries (UCQs), in the case where relational symbols have unrestricted arity and where the parameter is the size of the OMQ. We establish exact criteria for fixed-parameter tractability (fpt) evaluation of recursively enumerable classes of such OMQs (under the widely held Exponential Time Hypothesis). One of the main technical tools introduced in the paper is an fpt-reduction from deciding parameterized uniform CSPs to parameterized OMQ evaluation. The reduction preserves measures which are known to be essential for classifying recursively enumerable classes of parameterized uniform CSPs: submodular width (according to the well known result of Marx for unrestricted-arity schemas) and treewidth (according to the well known result of Grohe for bounded-arity schemas). As such, it can be employed to obtain hardness results for evaluation of recursively enumerable classes of parameterized OMQs both in the unrestricted and in the bounded arity case. Previously, in the case of bounded arity schemas, this has been tackled using a technique requiring full introspection into the construction employed by Grohe."
    },
    {
        "id": "2101.11750v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Chuteng Zhou, Quntao Zhuang, Matthew Mattina, Paul N. Whatmough",
        "title": "Information contraction in noisy binary neural networks and its   implications",
        "comments": "14 pages, 8 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.IT",
        "license": null,
        "abstract": "Neural networks have gained importance as the machine learning models that achieve state-of-the-art performance on large-scale image classification, object detection and natural language processing tasks. In this paper, we consider noisy binary neural networks, where each neuron has a non-zero probability of producing an incorrect output. These noisy models may arise from biological, physical and electronic contexts and constitute an important class of models that are relevant to the physical world. Intuitively, the number of neurons in such systems has to grow to compensate for the noise while maintaining the same level of expressive power and computation reliability. Our key finding is a lower bound for the required number of neurons in noisy neural networks, which is first of its kind. To prove this lower bound, we take an information theoretic approach and obtain a novel strong data processing inequality (SDPI), which not only generalizes the Evans-Schulman results for binary symmetric channels to general channels, but also improves the tightness drastically when applied to estimate end-to-end information contraction in networks. Our SDPI can be applied to various information processing systems, including neural networks and cellular automata. Applying the SDPI in noisy binary neural networks, we obtain our key lower bound and investigate its implications on network depth-width trade-offs, our results suggest a depth-width trade-off for noisy neural networks that is very different from the established understanding regarding noiseless neural networks. Furthermore, we apply the SDPI to study fault-tolerant cellular automata and obtain bounds on the error correction overheads and the relaxation time. This paper offers new understanding of noisy information processing systems through the lens of information theory."
    },
    {
        "id": "2101.11751v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Mohit Yadav, Daniel Sheldon, Cameron Musco",
        "title": "Faster Kernel Interpolation for Gaussian Processes",
        "comments": "To appear, Artificial Intelligence and Statistics (AISTATS) 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "A key challenge in scaling Gaussian Process (GP) regression to massive datasets is that exact inference requires computation with a dense n x n kernel matrix, where n is the number of data points. Significant work focuses on approximating the kernel matrix via interpolation using a smaller set of m inducing points. Structured kernel interpolation (SKI) is among the most scalable methods: by placing inducing points on a dense grid and using structured matrix algebra, SKI achieves per-iteration time of O(n + m log m) for approximate inference. This linear scaling in n enables inference for very large data sets; however the cost is per-iteration, which remains a limitation for extremely large n. We show that the SKI per-iteration time can be reduced to O(m log m) after a single O(n) time precomputation step by reframing SKI as solving a natural Bayesian linear regression problem with a fixed set of m compact basis functions. With per-iteration complexity independent of the dataset size n for a fixed grid, our method scales to truly massive data sets. We demonstrate speedups in practice for a wide range of m and n and apply the method to GP inference on a three-dimensional weather radar dataset with over 100 million points."
    },
    {
        "id": "2101.11775v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Veljko Dubljević, Sean Douglas, Jovan Milojevich, Nirav Ajmeri, William A. Bauer, George F. List, Munindar P. Singh",
        "title": "Moral and Social Ramifications of Autonomous Vehicles",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CY",
        "license": null,
        "abstract": "Autonomous Vehicles (AVs) raise important social and ethical concerns, especially about accountability, dignity, and justice. We focus on the specific concerns arising from how AV technology will affect the lives and livelihoods of professional and semi-professional drivers. Whereas previous studies of such concerns have focused on the opinions of experts, we seek to understand these ethical and societal challenges from the perspectives of the drivers themselves.   To this end, we adopted a qualitative research methodology based on semi-structured interviews. This is an established social science methodology that helps understand the core concerns of stakeholders in depth by avoiding the biases of superficial methods such as surveys.   We find that whereas drivers agree with the experts that AVs will significantly impact transportation systems, they are apprehensive about the prospects for their livelihoods and dismiss the suggestions that driving jobs are unsatisfying and their profession does not merit protection.   By showing how drivers differ from the experts, our study has ramifications beyond AVs to AI and other advanced technologies. Our findings suggest that qualitative research applied to the relevant, especially disempowered, stakeholders is essential to ensuring that new technologies are introduced ethically."
    },
    {
        "id": "2101.11812v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Chen Wang, Shaoxiong Wang, Branden Romero, Filipe Veiga, Edward Adelson",
        "title": "SwingBot: Learning Physical Features from In-hand Tactile Exploration   for Dynamic Swing-up Manipulation",
        "comments": "IROS 2020",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.RO",
        "license": null,
        "abstract": "Several robot manipulation tasks are extremely sensitive to variations of the physical properties of the manipulated objects. One such task is manipulating objects by using gravity or arm accelerations, increasing the importance of mass, center of mass, and friction information. We present SwingBot, a robot that is able to learn the physical features of a held object through tactile exploration. Two exploration actions (tilting and shaking) provide the tactile information used to create a physical feature embedding space. With this embedding, SwingBot is able to predict the swing angle achieved by a robot performing dynamic swing-up manipulations on a previously unseen object. Using these predictions, it is able to search for the optimal control parameters for a desired swing-up angle. We show that with the learned physical features our end-to-end self-supervised learning pipeline is able to substantially improve the accuracy of swinging up unseen objects. We also show that objects with similar dynamics are closer to each other on the embedding space and that the embedding can be disentangled into values of specific physical properties."
    },
    {
        "id": "2101.11832v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Abhishek Gupta",
        "title": "Making Responsible AI the Norm rather than the Exception",
        "comments": "A report prepared by the Montreal AI Ethics Institute for the\n  National Security Commission on Artificial Intelligence in response to their\n  Key Considerations for Responsible Development and Fielding of Artificial\n  Intelligence document; 26 pages",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CY",
        "license": null,
        "abstract": "This report prepared by the Montreal AI Ethics Institute provides recommendations in response to the National Security Commission on Artificial Intelligence (NSCAI) Key Considerations for Responsible Development and Fielding of Artificial Intelligence document. The report centres on the idea that Responsible AI should be made the Norm rather than an Exception. It does so by utilizing the guiding principles of: (1) alleviating friction in existing workflows, (2) empowering stakeholders to get buy-in, and (3) conducting an effective translation of abstract standards into actionable engineering practices. After providing some overarching comments on the document from the NSCAI, the report dives into the primary contribution of an actionable framework to help operationalize the ideas presented in the document from the NSCAI. The framework consists of: (1) a learning, knowledge, and information exchange (LKIE), (2) the Three Ways of Responsible AI, (3) an empirically-driven risk-prioritization matrix, and (4) achieving the right level of complexity. All components reinforce each other to move from principles to practice in service of making Responsible AI the norm rather than the exception."
    },
    {
        "id": "2101.11836v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Hrituraj Singh, Gaurav Verma, Aparna Garimella, Balaji Vasan Srinivasan",
        "title": "DRAG: Director-Generator Language Modelling Framework for Non-Parallel   Author Stylized Rewriting",
        "comments": "Accepted as Long Paper to EACL 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Author stylized rewriting is the task of rewriting an input text in a particular author's style. Recent works in this area have leveraged Transformer-based language models in a denoising autoencoder setup to generate author stylized text without relying on a parallel corpus of data. However, these approaches are limited by the lack of explicit control of target attributes and being entirely data-driven. In this paper, we propose a Director-Generator framework to rewrite content in the target author's style, specifically focusing on certain target attributes. We show that our proposed framework works well even with a limited-sized target author corpus. Our experiments on corpora consisting of relatively small-sized text authored by three distinct authors show significant improvements upon existing works to rewrite input texts in target author's style. Our quantitative and qualitative analyses further show that our model has better meaning retention and results in more fluent generations."
    },
    {
        "id": "2101.11844v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Iena Petronella Derks, Alta de Waal",
        "title": "A Taxonomy of Explainable Bayesian Networks",
        "comments": null,
        "journal-ref": "In: Gerber A. (eds) Artificial Intelligence Research. SACAIR 2021.\n  Communications in Computer and Information Science, vol 1342. Springer, Cham\n  (2020)",
        "doi": "10.1007/978-3-030-66151-9_14",
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Artificial Intelligence (AI), and in particular, the explainability thereof, has gained phenomenal attention over the last few years. Whilst we usually do not question the decision-making process of these systems in situations where only the outcome is of interest, we do however pay close attention when these systems are applied in areas where the decisions directly influence the lives of humans. It is especially noisy and uncertain observations close to the decision boundary which results in predictions which cannot necessarily be explained that may foster mistrust among end-users. This drew attention to AI methods for which the outcomes can be explained. Bayesian networks are probabilistic graphical models that can be used as a tool to manage uncertainty. The probabilistic framework of a Bayesian network allows for explainability in the model, reasoning and evidence. The use of these methods is mostly ad hoc and not as well organised as explainability methods in the wider AI research field. As such, we introduce a taxonomy of explainability in Bayesian networks. We extend the existing categorisation of explainability in the model, reasoning or evidence to include explanation of decisions. The explanations obtained from the explainability methods are illustrated by means of a simple medical diagnostic scenario. The taxonomy introduced in this paper has the potential not only to encourage end-users to efficiently communicate outcomes obtained, but also support their understanding of how and, more importantly, why certain predictions were made."
    },
    {
        "id": "2102.01649v4",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Jinjiang Guo, Jie Li, Dawei Leng, Lurong Pan",
        "title": "Heterogeneous Graph based Deep Learning for Biomedical Network Link   Prediction",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.SI",
        "license": null,
        "abstract": "Multi-scale biomedical knowledge networks are expanding with emerging experimental technologies that generates multi-scale biomedical big data. Link prediction is increasingly used especially in bipartite biomedical networks to identify hidden biological interactions and relationshipts between key entities such as compounds, targets, gene and diseases. We propose a Graph Neural Networks (GNN) method, namely Graph Pair based Link Prediction model (GPLP), for predicting biomedical network links simply based on their topological interaction information. In GPLP, 1-hop subgraphs extracted from known network interaction matrix is learnt to predict missing links. To evaluate our method, three heterogeneous biomedical networks were used, i.e. Drug-Target Interaction network (DTI), Compound-Protein Interaction network (CPI) from NIH Tox21, and Compound-Virus Inhibition network (CVI). Our proposed GPLP method significantly outperforms over the state-of-the-art baselines. In addition, different network incompleteness is analysed with our devised protocol, and we also design an effective approach to improve the model robustness towards incomplete networks. Our method demonstrates the potential applications in other biomedical networks."
    },
    {
        "id": "2101.11870v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Emmanuel Hadoux, Anthony Hunter, Sylwia Polberg",
        "title": "Strategic Argumentation Dialogues for Persuasion: Framework and   Experiments Based on Modelling the Beliefs and Concerns of the Persuadee",
        "comments": "The Data Appendix containing the arguments, argument graphs,\n  assignment of concerns to arguments, preferences over concerns, and\n  assignment of beliefs to arguments, is available at the link\n  http://www0.cs.ucl.ac.uk/staff/a.hunter/papers/unistudydata.zip The code is\n  available at https://github.com/ComputationalPersuasion/MCCP",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Persuasion is an important and yet complex aspect of human intelligence. When undertaken through dialogue, the deployment of good arguments, and therefore counterarguments, clearly has a significant effect on the ability to be successful in persuasion. Two key dimensions for determining whether an argument is good in a particular dialogue are the degree to which the intended audience believes the argument and counterarguments, and the impact that the argument has on the concerns of the intended audience. In this paper, we present a framework for modelling persuadees in terms of their beliefs and concerns, and for harnessing these models in optimizing the choice of move in persuasion dialogues. Our approach is based on the Monte Carlo Tree Search which allows optimization in real-time. We provide empirical results of a study with human participants showing that our automated persuasion system based on this technology is superior to a baseline system that does not take the beliefs and concerns into account in its strategy."
    },
    {
        "id": "2101.11881v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Rohitash Chandra, Ayush Jain, Divyanshu Singh Chauhan",
        "title": "Deep learning via LSTM models for COVID-19 infection forecasting in   India",
        "comments": "PLOS One, 2022",
        "journal-ref": null,
        "doi": "10.1371/journal.pone.0262708",
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "The COVID-19 pandemic continues to have major impact to health and medical infrastructure, economy, and agriculture. Prominent computational and mathematical models have been unreliable due to the complexity of the spread of infections. Moreover, lack of data collection and reporting makes modelling attempts difficult and unreliable. Hence, we need to re-look at the situation with reliable data sources and innovative forecasting models. Deep learning models such as recurrent neural networks are well suited for modelling spatiotemporal sequences. In this paper, we apply recurrent neural networks such as long short term memory (LSTM), bidirectional LSTM, and encoder-decoder LSTM models for multi-step (short-term) COVID-19 infection forecasting. We select Indian states with COVID-19 hotpots and capture the first (2020) and second (2021) wave of infections and provide two months ahead forecast. Our model predicts that the likelihood of another wave of infections in October and November 2021 is low; however, the authorities need to be vigilant given emerging variants of the virus. The accuracy of the predictions motivate the application of the method in other countries and regions. Nevertheless, the challenges in modelling remain due to the reliability of data and difficulties in capturing factors such as population density, logistics, and social aspects such as culture and lifestyle."
    },
    {
        "id": "2101.11885v3",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Tineke Blom, Joris M. Mooij",
        "title": "Causality and independence in perfectly adapted dynamical systems",
        "comments": "35 pages, to appear in Journal of Causal Inference",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Perfect adaptation in a dynamical system is the phenomenon that one or more variables have an initial transient response to a persistent change in an external stimulus but revert to their original value as the system converges to equilibrium. With the help of the causal ordering algorithm, one can construct graphical representations of dynamical systems that represent the causal relations between the variables and the conditional independences in the equilibrium distribution. We apply these tools to formulate sufficient graphical conditions for identifying perfect adaptation from a set of first-order differential equations. Furthermore, we give sufficient conditions to test for the presence of perfect adaptation in experimental equilibrium data. We apply this method to a simple model for a protein signalling pathway and test its predictions both in simulations and using real-world protein expression data. We demonstrate that perfect adaptation can lead to misleading orientation of edges in the output of causal discovery algorithms."
    },
    {
        "id": "2101.11888v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Johannes Bjerva, Isabelle Augenstein",
        "title": "Does Typological Blinding Impede Cross-Lingual Sharing?",
        "comments": "EACL 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Bridging the performance gap between high- and low-resource languages has been the focus of much previous work. Typological features from databases such as the World Atlas of Language Structures (WALS) are a prime candidate for this, as such data exists even for very low-resource languages. However, previous work has only found minor benefits from using typological information. Our hypothesis is that a model trained in a cross-lingual setting will pick up on typological cues from the input data, thus overshadowing the utility of explicitly using such features. We verify this hypothesis by blinding a model to typological information, and investigate how cross-lingual sharing and performance is impacted. Our model is based on a cross-lingual architecture in which the latent weights governing the sharing between languages is learnt during training. We show that (i) preventing this model from exploiting typology severely reduces performance, while a control experiment reaffirms that (ii) encouraging sharing according to typology somewhat improves performance."
    },
    {
        "id": "2101.11890v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Timothy Atkinson, Saeed Saremi, Faustino Gomez, Jonathan Masci",
        "title": "Automatic design of novel potential 3CL$^{\\text{pro}}$ and   PL$^{\\text{pro}}$ inhibitors",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "With the goal of designing novel inhibitors for SARS-CoV-1 and SARS-CoV-2, we propose the general molecule optimization framework, Molecular Neural Assay Search (MONAS), consisting of three components: a property predictor which identifies molecules with specific desirable properties, an energy model which approximates the statistical similarity of a given molecule to known training molecules, and a molecule search method. In this work, these components are instantiated with graph neural networks (GNNs), Deep Energy Estimator Networks (DEEN) and Monte Carlo tree search (MCTS), respectively. This implementation is used to identify 120K molecules (out of 40-million explored) which the GNN determined to be likely SARS-CoV-1 inhibitors, and, at the same time, are statistically close to the dataset used to train the GNN."
    },
    {
        "id": "2101.11946v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Stefan Heidekrüger, Paul Sutterer, Nils Kohring, Maximilian Fichtl, Martin Bichler",
        "title": "Equilibrium Learning in Combinatorial Auctions: Computing Approximate   Bayesian Nash Equilibria via Pseudogradient Dynamics",
        "comments": "This version includes the supplementary material with additional\n  proofs",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.GT",
        "license": null,
        "abstract": "Applications of combinatorial auctions (CA) as market mechanisms are prevalent in practice, yet their Bayesian Nash equilibria (BNE) remain poorly understood. Analytical solutions are known only for a few cases where the problem can be reformulated as a tractable partial differential equation (PDE). In the general case, finding BNE is known to be computationally hard. Previous work on numerical computation of BNE in auctions has relied either on solving such PDEs explicitly, calculating pointwise best-responses in strategy space, or iteratively solving restricted subgames. In this study, we present a generic yet scalable alternative multi-agent equilibrium learning method that represents strategies as neural networks and applies policy iteration based on gradient dynamics in self-play. Most auctions are ex-post nondifferentiable, so gradients may be unavailable or misleading, and we rely on suitable pseudogradient estimates instead. Although it is well-known that gradient dynamics cannot guarantee convergence to NE in general, we observe fast and robust convergence to approximate BNE in a wide variety of auctions and present a sufficient condition for convergence"
    },
    {
        "id": "2101.11952v4",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Xue Yang, Junchi Yan, Qi Ming, Wentao Wang, Xiaopeng Zhang, Qi Tian",
        "title": "Rethinking Rotated Object Detection with Gaussian Wasserstein Distance   Loss",
        "comments": "15 pages, 6 figures, 9 tables, accepted by ICML21, codes are\n  available at https://github.com/yangxue0827/RotationDetection and\n  https://github.com/open-mmlab/mmrotate",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Boundary discontinuity and its inconsistency to the final detection metric have been the bottleneck for rotating detection regression loss design. In this paper, we propose a novel regression loss based on Gaussian Wasserstein distance as a fundamental approach to solve the problem. Specifically, the rotated bounding box is converted to a 2-D Gaussian distribution, which enables to approximate the indifferentiable rotational IoU induced loss by the Gaussian Wasserstein distance (GWD) which can be learned efficiently by gradient back-propagation. GWD can still be informative for learning even there is no overlapping between two rotating bounding boxes which is often the case for small object detection. Thanks to its three unique properties, GWD can also elegantly solve the boundary discontinuity and square-like problem regardless how the bounding box is defined. Experiments on five datasets using different detectors show the effectiveness of our approach. Codes are available at https://github.com/yangxue0827/RotationDetection and https://github.com/open-mmlab/mmrotate."
    },
    {
        "id": "2101.11954v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Tathagata Raha, Vijayasaradhi Indurthi, Aayush Upadhyaya, Jeevesh Kataria, Pramud Bommakanti, Vikram Keswani, Vasudeva Varma",
        "title": "Identifying COVID-19 Fake News in Social Media",
        "comments": "CONSTRAINT@AAAI",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "The evolution of social media platforms have empowered everyone to access information easily. Social media users can easily share information with the rest of the world. This may sometimes encourage spread of fake news, which can result in undesirable consequences. In this work, we train models which can identify health news related to COVID-19 pandemic as real or fake. Our models achieve a high F1-score of 98.64%. Our models achieve second place on the leaderboard, tailing the first position with a very narrow margin 0.05% points."
    },
    {
        "id": "2101.11956v3",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Pere-Lluís Huguet-Cabot, David Abadi, Agneta Fischer, Ekaterina Shutova",
        "title": "Us vs. Them: A Dataset of Populist Attitudes, News Bias and Emotions",
        "comments": "Camera-ready version in EACL 2021",
        "journal-ref": null,
        "doi": "10.18653/v1/2021.eacl-main.165",
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "Computational modelling of political discourse tasks has become an increasingly important area of research in natural language processing. Populist rhetoric has risen across the political sphere in recent years; however, computational approaches to it have been scarce due to its complex nature. In this paper, we present the new $\\textit{Us vs. Them}$ dataset, consisting of 6861 Reddit comments annotated for populist attitudes and the first large-scale computational models of this phenomenon. We investigate the relationship between populist mindsets and social groups, as well as a range of emotions typically associated with these. We set a baseline for two tasks related to populist attitudes and present a set of multi-task learning models that leverage and demonstrate the importance of emotion and group identification as auxiliary tasks."
    },
    {
        "id": "2101.11967v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "David O'Callaghan, Patrick Mannion",
        "title": "Exploring the Impact of Tunable Agents in Sequential Social Dilemmas",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.MA",
        "license": null,
        "abstract": "When developing reinforcement learning agents, the standard approach is to train an agent to converge to a fixed policy that is as close to optimal as possible for a single fixed reward function. If different agent behaviour is required in the future, an agent trained in this way must normally be either fully or partially retrained, wasting valuable time and resources. In this study, we leverage multi-objective reinforcement learning to create tunable agents, i.e. agents that can adopt a range of different behaviours according to the designer's preferences, without the need for retraining. We apply this technique to sequential social dilemmas, settings where there is inherent tension between individual and collective rationality. Learning a single fixed policy in such settings leaves one at a significant disadvantage if the opponents' strategies change after learning is complete. In our work, we demonstrate empirically that the tunable agents framework allows easy adaption between cooperative and competitive behaviours in sequential social dilemmas without the need for retraining, allowing a single trained agent model to be adjusted to cater for a wide range of behaviours and opponent strategies."
    },
    {
        "id": "2101.11974v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Zeerak Waseem, Smarika Lulz, Joachim Bingel, Isabelle Augenstein",
        "title": "Disembodied Machine Learning: On the Illusion of Objectivity in NLP",
        "comments": "In review",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Machine Learning seeks to identify and encode bodies of knowledge within provided datasets. However, data encodes subjective content, which determines the possible outcomes of the models trained on it. Because such subjectivity enables marginalisation of parts of society, it is termed (social) `bias' and sought to be removed. In this paper, we contextualise this discourse of bias in the ML community against the subjective choices in the development process. Through a consideration of how choices in data and model development construct subjectivity, or biases that are represented in a model, we argue that addressing and mitigating biases is near-impossible. This is because both data and ML models are objects for which meaning is made in each step of the development pipeline, from data selection over annotation to model training and analysis. Accordingly, we find the prevalent discourse of bias limiting in its ability to address social marginalisation. We recommend to be conscientious of this, and to accept that de-biasing methods only correct for a fraction of biases."
    },
    {
        "id": "2101.11981v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Yaqi Xie, Fan Zhou, Harold Soh",
        "title": "Embedding Symbolic Temporal Knowledge into Deep Sequential Models",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.AI",
        "license": null,
        "abstract": "Sequences and time-series often arise in robot tasks, e.g., in activity recognition and imitation learning. In recent years, deep neural networks (DNNs) have emerged as an effective data-driven methodology for processing sequences given sufficient training data and compute resources. However, when data is limited, simpler models such as logic/rule-based methods work surprisingly well, especially when relevant prior knowledge is applied in their construction. However, unlike DNNs, these \"structured\" models can be difficult to extend, and do not work well with raw unstructured data. In this work, we seek to learn flexible DNNs, yet leverage prior temporal knowledge when available. Our approach is to embed symbolic knowledge expressed as linear temporal logic (LTL) and use these embeddings to guide the training of deep models. Specifically, we construct semantic-based embeddings of automata generated from LTL formula via a Graph Neural Network. Experiments show that these learnt embeddings can lead to improvements in downstream robot tasks such as sequential action recognition and imitation learning."
    },
    {
        "id": "2101.11987v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Sindhu Hegde, Shankar Gangisetty",
        "title": "PIG-Net: Inception based Deep Learning Architecture for 3D Point Cloud   Segmentation",
        "comments": "11 pages, 5 Figures, 6 Tables, Accepted in Computers & Graphics\n  Journal 2021",
        "journal-ref": null,
        "doi": "10.1016/j.cag.2021.01.004",
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "Point clouds, being the simple and compact representation of surface geometry of 3D objects, have gained increasing popularity with the evolution of deep learning networks for classification and segmentation tasks. Unlike human, teaching the machine to analyze the segments of an object is a challenging task and quite essential in various machine vision applications. In this paper, we address the problem of segmentation and labelling of the 3D point clouds by proposing a inception based deep network architecture called PIG-Net, that effectively characterizes the local and global geometric details of the point clouds. In PIG-Net, the local features are extracted from the transformed input points using the proposed inception layers and then aligned by feature transform. These local features are aggregated using the global average pooling layer to obtain the global features. Finally, feed the concatenated local and global features to the convolution layers for segmenting the 3D point clouds. We perform an exhaustive experimental analysis of the PIG-Net architecture on two state-of-the-art datasets, namely, ShapeNet [1] and PartNet [2]. We evaluate the effectiveness of our network by performing ablation study."
    },
    {
        "id": "2101.11992v4",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Esther Derman, Gal Dalal, Shie Mannor",
        "title": "Acting in Delayed Environments with Non-Stationary Markov Policies",
        "comments": "Published in ICLR 2021",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "The standard Markov Decision Process (MDP) formulation hinges on the assumption that an action is executed immediately after it was chosen. However, assuming it is often unrealistic and can lead to catastrophic failures in applications such as robotic manipulation, cloud computing, and finance. We introduce a framework for learning and planning in MDPs where the decision-maker commits actions that are executed with a delay of $m$ steps. The brute-force state augmentation baseline where the state is concatenated to the last $m$ committed actions suffers from an exponential complexity in $m$, as we show for policy iteration. We then prove that with execution delay, deterministic Markov policies in the original state-space are sufficient for attaining maximal reward, but need to be non-stationary. As for stationary Markov policies, we show they are sub-optimal in general. Consequently, we devise a non-stationary Q-learning style model-based algorithm that solves delayed execution tasks without resorting to state-augmentation. Experiments on tabular, physical, and Atari domains reveal that it converges quickly to high performance even for substantial delays, while standard approaches that either ignore the delay or rely on state-augmentation struggle or fail due to divergence. The code is available at github.com/galdl/rl_delay_basic and github.com/galdl/rl_delay_atari."
    },
    {
        "id": "2101.12002v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Soundouss Messoudi, Sébastien Destercke, Sylvain Rousseau",
        "title": "Copula-based conformal prediction for Multi-Target Regression",
        "comments": "17 pages, 8 figures, under review",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "There are relatively few works dealing with conformal prediction for multi-task learning issues, and this is particularly true for multi-target regression. This paper focuses on the problem of providing valid (i.e., frequency calibrated) multi-variate predictions. To do so, we propose to use copula functions applied to deep neural networks for inductive conformal prediction. We show that the proposed method ensures efficiency and validity for multi-target regression problems on various data sets."
    },
    {
        "id": "2101.12015v3",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Paulo Finardi, José Dié Viegas, Gustavo T. Ferreira, Alex F. Mansano, Vinicius F. Caridá",
        "title": "BERTaú: Itaú BERT for digital customer service",
        "comments": "10 pages, 5 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CL",
        "license": null,
        "abstract": "In the last few years, three major topics received increased interest: deep learning, NLP and conversational agents. Bringing these three topics together to create an amazing digital customer experience and indeed deploy in production and solve real-world problems is something innovative and disruptive. We introduce a new Portuguese financial domain language representation model called BERTa\\'u. BERTa\\'u is an uncased BERT-base trained from scratch with data from the Ita\\'u virtual assistant chatbot solution. Our novel contribution is that BERTa\\'u pretrained language model requires less data, reached state-of-the-art performance in three NLP tasks, and generates a smaller and lighter model that makes the deployment feasible. We developed three tasks to validate our model: information retrieval with Frequently Asked Questions (FAQ) from Ita\\'u bank, sentiment analysis from our virtual assistant data, and a NER solution. All proposed tasks are real-world solutions in production on our environment and the usage of a specialist model proved to be effective when compared to Google BERT multilingual and the DPRQuestionEncoder from Facebook, available at Hugging Face. The BERTa\\'u improves the performance in 22% of FAQ Retrieval MRR metric, 2.1% in Sentiment Analysis F1 score, 4.4% in NER F1 score and can also represent the same sequence in up to 66% fewer tokens when compared to \"shelf models\"."
    },
    {
        "id": "2101.12051v5",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Shuai Wang, Yuncong Hong, Rui Wang, Qi Hao, Yik-Chung Wu, Derrick Wing Kwan Ng",
        "title": "Edge Federated Learning Via Unit-Modulus Over-The-Air Computation",
        "comments": "IEEE Transactions on Communications, vol. 70, no. 5, 2022",
        "journal-ref": null,
        "doi": "10.1109/TCOMM.2022.3153488",
        "report-no": null,
        "categories": "cs.IT",
        "license": null,
        "abstract": "Edge federated learning (FL) is an emerging paradigm that trains a global parametric model from distributed datasets based on wireless communications. This paper proposes a unit-modulus over-the-air computation (UMAirComp) framework to facilitate efficient edge federated learning, which simultaneously uploads local model parameters and updates global model parameters via analog beamforming. The proposed framework avoids sophisticated baseband signal processing, leading to low communication delays and implementation costs. Training loss bounds of UMAirComp FL systems are derived and two low-complexity large-scale optimization algorithms, termed penalty alternating minimization (PAM) and accelerated gradient projection (AGP), are proposed to minimize the nonconvex nonsmooth loss bound. Simulation results show that the proposed UMAirComp framework with PAM algorithm achieves a smaller mean square error of model parameters' estimation, training loss, and test error compared with other benchmark schemes. Moreover, the proposed UMAirComp framework with AGP algorithm achieves satisfactory performance while reduces the computational complexity by orders of magnitude compared with existing optimization algorithms. Finally, we demonstrate the implementation of UMAirComp in a vehicle-to-everything autonomous driving simulation platform. It is found that autonomous driving tasks are more sensitive to model parameter errors than other tasks since the neural networks for autonomous driving contain sparser model parameters."
    },
    {
        "id": "2101.12072v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Kashif Rasul, Calvin Seward, Ingmar Schuster, Roland Vollgraf",
        "title": "Autoregressive Denoising Diffusion Models for Multivariate Probabilistic   Time Series Forecasting",
        "comments": null,
        "journal-ref": "Proceedings of the 38th International Conference on Machine\n  Learning, PMLR 139:8857-8868, 2021",
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "In this work, we propose \\texttt{TimeGrad}, an autoregressive model for multivariate probabilistic time series forecasting which samples from the data distribution at each time step by estimating its gradient. To this end, we use diffusion probabilistic models, a class of latent variable models closely connected to score matching and energy-based methods. Our model learns gradients by optimizing a variational bound on the data likelihood and at inference time converts white noise into a sample of the distribution of interest through a Markov chain using Langevin sampling. We demonstrate experimentally that the proposed autoregressive denoising diffusion model is the new state-of-the-art multivariate probabilistic forecasting method on real-world data sets with thousands of correlated dimensions. We hope that this method is a useful tool for practitioners and lays the foundation for future research in this area."
    },
    {
        "id": "2101.12078v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Prashanthi Ramachandran, Shivam Agarwal, Arup Mondal, Aastha Shah, Debayan Gupta",
        "title": "S++: A Fast and Deployable Secure-Computation Framework for   Privacy-Preserving Neural Network Training",
        "comments": "Appeared at the Second AAAI Workshop on Privacy-Preserving Artificial\n  Intelligence (PPAI-21). (7 pages, technical paper.)",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CR",
        "license": null,
        "abstract": "We introduce S++, a simple, robust, and deployable framework for training a neural network (NN) using private data from multiple sources, using secret-shared secure function evaluation. In short, consider a virtual third party to whom every data-holder sends their inputs, and which computes the neural network: in our case, this virtual third party is actually a set of servers which individually learn nothing, even with a malicious (but non-colluding) adversary.   Previous work in this area has been limited to just one specific activation function: ReLU, rendering the approach impractical for many use-cases. For the first time, we provide fast and verifiable protocols for all common activation functions and optimize them for running in a secret-shared manner. The ability to quickly, verifiably, and robustly compute exponentiation, softmax, sigmoid, etc., allows us to use previously written NNs without modification, vastly reducing developer effort and complexity of code. In recent times, ReLU has been found to converge much faster and be more computationally efficient as compared to non-linear functions like sigmoid or tanh. However, we argue that it would be remiss not to extend the mechanism to non-linear functions such as the logistic sigmoid, tanh, and softmax that are fundamental due to their ability to express outputs as probabilities and their universal approximation property. Their contribution in RNNs and a few recent advancements also makes them more relevant."
    },
    {
        "id": "2101.12097v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Hamidreza Habibollahi Najaf Abadi",
        "title": "Adversarial Machine Learning Attacks on Condition-Based Maintenance   Capabilities",
        "comments": "9 pages, 7 figures",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Condition-based maintenance (CBM) strategies exploit machine learning models to assess the health status of systems based on the collected data from the physical environment, while machine learning models are vulnerable to adversarial attacks. A malicious adversary can manipulate the collected data to deceive the machine learning model and affect the CBM system's performance. Adversarial machine learning techniques introduced in the computer vision domain can be used to make stealthy attacks on CBM systems by adding perturbation to data to confuse trained models. The stealthy nature causes difficulty and delay in detection of the attacks. In this paper, adversarial machine learning in the domain of CBM is introduced. A case study shows how adversarial machine learning can be used to attack CBM capabilities. Adversarial samples are crafted using the Fast Gradient Sign method, and the performance of a CBM system under attack is investigated. The obtained results reveal that CBM systems are vulnerable to adversarial machine learning attacks and defense strategies need to be considered."
    },
    {
        "id": "2101.12100v3",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Giulio Rossolini, Alessandro Biondi, Giorgio Buttazzo",
        "title": "Increasing the Confidence of Deep Neural Networks by Coverage Analysis",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "The great performance of machine learning algorithms and deep neural networks in several perception and control tasks is pushing the industry to adopt such technologies in safety-critical applications, as autonomous robots and self-driving vehicles. At present, however, several issues need to be solved to make deep learning methods more trustworthy, predictable, safe, and secure against adversarial attacks. Although several methods have been proposed to improve the trustworthiness of deep neural networks, most of them are tailored for specific classes of adversarial examples, hence failing to detect other corner cases or unsafe inputs that heavily deviate from the training samples. This paper presents a lightweight monitoring architecture based on coverage paradigms to enhance the model robustness against different unsafe inputs. In particular, four coverage analysis methods are proposed and tested in the architecture for evaluating multiple detection logics. Experimental results show that the proposed approach is effective in detecting both powerful adversarial examples and out-of-distribution inputs, introducing limited extra-execution time and memory requirements."
    },
    {
        "id": "2101.12136v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Ghada Sokar, Decebal Constantin Mocanu, Mykola Pechenizkiy",
        "title": "Self-Attention Meta-Learner for Continual Learning",
        "comments": null,
        "journal-ref": "20th International Conference on Autonomous Agents and Multiagent\n  Systems (AAMAS 2021)",
        "doi": null,
        "report-no": null,
        "categories": "cs.LG",
        "license": null,
        "abstract": "Continual learning aims to provide intelligent agents capable of learning multiple tasks sequentially with neural networks. One of its main challenging, catastrophic forgetting, is caused by the neural networks non-optimal ability to learn in non-stationary distributions. In most settings of the current approaches, the agent starts from randomly initialized parameters and is optimized to master the current task regardless of the usefulness of the learned representation for future tasks. Moreover, each of the future tasks uses all the previously learned knowledge although parts of this knowledge might not be helpful for its learning. These cause interference among tasks, especially when the data of previous tasks is not accessible. In this paper, we propose a new method, named Self-Attention Meta-Learner (SAM), which learns a prior knowledge for continual learning that permits learning a sequence of tasks, while avoiding catastrophic forgetting. SAM incorporates an attention mechanism that learns to select the particular relevant representation for each future task. Each task builds a specific representation branch on top of the selected knowledge, avoiding the interference between tasks. We evaluate the proposed method on the Split CIFAR-10/100 and Split MNIST benchmarks in the task agnostic inference. We empirically show that we can achieve a better performance than several state-of-the-art methods for continual learning by building on the top of selected representation learned by SAM. We also show the role of the meta-attention mechanism in boosting informative features corresponding to the input data and identifying the correct target in the task agnostic inference. Finally, we demonstrate that popular existing continual learning methods gain a performance boost when they adopt SAM as a starting point."
    },
    {
        "id": "2101.12153v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Sahraoui Dhelim, Nyothiri Aung, Mohammed Amine Bouras, Huansheng Ning, Erik Cambria",
        "title": "A Survey on Personality-Aware Recommendation Systems",
        "comments": "The final version is published in Artificial Intelligence Review\n  (2021) https://link.springer.com/article/10.1007/s10462-021-10063-7",
        "journal-ref": null,
        "doi": "10.1007/s10462-021-10063-7",
        "report-no": null,
        "categories": "cs.IR",
        "license": null,
        "abstract": "With the emergence of personality computing as a new research field related to artificial intelligence and personality psychology, we have witnessed an unprecedented proliferation of personality-aware recommendation systems. Unlike conventional recommendation systems, these new systems solve traditional problems such as the cold start and data sparsity problems. This survey aims to study and systematically classify personality-aware recommendation systems. To the best of our knowledge, this survey is the first that focuses on personality-aware recommendation systems. We explore the different design choices of personality-aware recommendation systems, by comparing their personality modeling methods, as well as their recommendation techniques. Furthermore, we present the commonly used datasets and point out some of the challenges of personality-aware recommendation systems."
    },
    {
        "id": "2101.12195v1",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Willi Menapace, Stéphane Lathuilière, Sergey Tulyakov, Aliaksandr Siarohin, Elisa Ricci",
        "title": "Playable Video Generation",
        "comments": null,
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.CV",
        "license": null,
        "abstract": "This paper introduces the unsupervised learning problem of playable video generation (PVG). In PVG, we aim at allowing a user to control the generated video by selecting a discrete action at every time step as when playing a video game. The difficulty of the task lies both in learning semantically consistent actions and in generating realistic videos conditioned on the user input. We propose a novel framework for PVG that is trained in a self-supervised manner on a large dataset of unlabelled videos. We employ an encoder-decoder architecture where the predicted action labels act as bottleneck. The network is constrained to learn a rich action space using, as main driving loss, a reconstruction loss on the generated video. We demonstrate the effectiveness of the proposed approach on several datasets with wide environment variety. Further details, code and examples are available on our project page willi-menapace.github.io/playable-video-generation-website."
    },
    {
        "id": "2101.12241v2",
        "submitter": null,
        "published": "2021-01-28",
        "authors": "Rui Wang, Kai Gao, Daniel Nakhimovich, Jingjin Yu, Kostas E. Bekris",
        "title": "Uniform Object Rearrangement: From Complete Monotone Primitives to   Efficient Non-Monotone Informed Search",
        "comments": "Accepted to IEEE International Conference on Robotics and Automation\n  (ICRA 2021)",
        "journal-ref": null,
        "doi": null,
        "report-no": null,
        "categories": "cs.RO",
        "license": null,
        "abstract": "Object rearrangement is a widely-applicable and challenging task for robots. Geometric constraints must be carefully examined to avoid collisions and combinatorial issues arise as the number of objects increases. This work studies the algorithmic structure of rearranging uniform objects, where robot-object collisions do not occur but object-object collisions have to be avoided. The objective is minimizing the number of object transfers under the assumption that the robot can manipulate one object at a time. An efficiently computable decomposition of the configuration space is used to create a \"region graph\", which classifies all continuous paths of equivalent collision possibilities. Based on this compact but rich representation, a complete dynamic programming primitive DFSDP performs a recursive depth first search to solve monotone problems quickly, i.e., those instances that do not require objects to be moved first to an intermediate buffer. DFSDP is extended to solve single-buffer, non-monotone instances, given a choice of an object and a buffer. This work utilizes these primitives as local planners in an informed search framework for more general, non-monotone instances. The search utilizes partial solutions from the primitives to identify the most promising choice of objects and buffers. Experiments demonstrate that the proposed solution returns near-optimal paths with higher success rate, even for challenging non-monotone instances, than other leading alternatives."
    }
]